{
  "artAndDesign": {
    "total_reviews": 934,
    "total_female_positive_reviews": 398,
    "total_male_positive_reviews": 317,
    "total_female_reviews": 507,
    "total_male_reviews": 427,
    "top_women_positive_reviews": [
      [
        -0.9925,
        "It is very good . I didn't know about it, but I found it was there from default in galaxy tab S6 . So I started using this app and loved it. It is great for people who love painting also good for those who wanna learn painting. The community is also extremely good, so you can post your painting easily, you get likes and comments for good works. You can see others paintings and add it to your favorites if you want. And if you don't want to draw you can simply go for coloring."
      ],
      [
        -0.9912,
        "I think that it is also excellent but there is is a need for change in the save and browse section whenever you start the application you find it on the same page where you left the last time, so this is a bit untidy. Also the saved art should be in pictures not in a progressing form. just this problem and rest is beautiful..😊😊☺☺🙂"
      ],
      [
        -0.9888,
        "I've been useing this app for over a year. Still the best build app there is. Now too the developer, I love this app. I dig the furniture theam and it works great. I on the hand love building boats, cars, trucks plains, houses. Even people my very favorite was a fishing boat floating in a glass pond with fish under the boat. So saying that I would really love to see a way to make elbows for building plumbing fixtures or muffler pipes. Still the best app and easiest to pick up and lean to use"
      ],
      [
        -0.9832,
        "Awesome drawing app it really gives you freedom to draw whatever you while staying completely free! If I had any complaint it would be that I would like a fill tool added, I find a tool like that extremely helpful. Otherwise great app 👌"
      ],
      [
        -0.9874,
        "This is the most fun I've had with AI! So easy to use, I couldn't stop when I found it, made over 100 pics the first night. Impressive technology! Eventually I found the \"Buy Print\" feature. I didn't know what to expect, but I gave it a try. Very vibrant colors, so I expected to be disappointed, as a print wouldn't be back lit like it is on my phone. Pleasant surprise! So bright! Gorgeous print! If you're on the fence about getting a print, rest assured, highest quality materials are used."
      ],
      [
        -0.9846,
        "It's good for drawing✏️. For me it's good for drawing and other stuff (like when I tween) and there is nothing wrong with it! No bugs, no lagging and things like that it's really awesome😁. Tons of brushes🖌️! But most of the brushes are locked and you can just unlock them by watching ads🔓. So much tools and they're all so useful :D! Very nice, recommend if you're searching for a fantastic drawing app 👍"
      ],
      [
        -0.9865,
        "This is such a great drawing app, honestly can't believe that it's free. You get so many great features and you can create some awesome artwork with it. It's kind of hard to use on a smartphone with a smaller screen and it takes some getting used to, but other than that I had an amazing experience while using the app. 9/10, would definitely recommend trying it out especially if you want to try your hand at digital art :)"
      ],
      [
        -0.9739,
        "Awesome app with awesome several many templates, elements and backgrounds. I love this app. Everyone should give it a try. It's simply superb 👌"
      ],
      [
        -0.9811,
        "I love this game I know that I am only 4th standard kid but I love this game I know this game I have done so many pictures I love this game my I have drawn today picture what is that so my picture scenery with the watercolor are use of your watercolor design and it is so niceand then I like this game and I drone then I draw a big set in beat set I have done send then what areI don't know how to draw kids but now the kids are it it is so nice game so I can now make it in a paper also I like this"
      ],
      [
        -0.9788,
        "I love this app, just missing some features. I would like to open and edit svg files in it and also want to copy elements from one file to another. Anyway it is a great vectorbase app for a reasonable price. Easy to use and you can save your work in svg format to import it in Adobe Illustrator. Thanks!😊 Sometimes when I zoom in and out the lines break or transform (get shorter), please fix this issue."
      ]
    ],
    "top_men_positive_reviews": [
      [
        -0.9943,
        "I have tried many different deep dream /a.i. collab art apps for mobile devices. This is by far the best one I have come across.There may not be as many options to tweak the parameters, but nevertheless the results are absolutely gorgeous!! Incredibly beautiful and astounding! This app is so much fun to play around with. I love it. Thank you for creating this app and making it available for free! I highly recommend this app.💫"
      ],
      [
        -0.9905,
        "The application is very powerful. I like it very much.. a big thanks to the developer.. yeah sometimes in my 4gb ram phone, the application close automatically without any warning so.. i need to save every time i made some changes to the project working, for me it's not a serious problem. 😍😍😍😍😍I love the app. Adding Soft round brush with adjustable feathers and opacity control ; Blending options of the layers would be a very wonderful feature to add in coming future updates."
      ],
      [
        -0.9849,
        "When you make a selection, I feel like there should be an \"Add To Brush Patterns\" option. More importantly, could you also add an animation feature? This app is great as is, but I would benefit so much if I could animate with it like Flipaclip. I would also love to see you and Visual Blasters come together to make an app for Art and Animation. You guys are awesome. Keep up the amazing work."
      ],
      [
        -0.9893,
        "Had it 5 mins, Loving it!! Had this App, nearly a Year...and am still Super Happy with it. Sometimes the detailing of a certain graphic will blur when uploaded to fb. That's my only issue, everything else is GREAT!! Love this App💯❣🥰"
      ],
      [
        -0.9885,
        "Great app for business post and greetings on festival. App also have inspirational motivation devotional etc many more categories of post. Best part of this app is edit tool which work efficient and user friendly. Wide range of Business categories post. Customer support services also good. Video editing tool also very user friendly."
      ],
      [
        -0.9844,
        "I really like the vector-based nature of this app. I use it on a Galaxy S22 Ultra with S-pen and on Windows with a mouse. The interface has a bit of a learning curve, but is totally worth it, as it allows you to be very productive. They have a nice balance between the free version and the paid features - plenty of people will never need the paid features. If you use the product regularly, you'll want the pro features, and I think the price is a bargain compared to something like Adobe Illustrator. I've contacted their support team with a couple of questions, and they got back to me very quickly with friendly and helpful replies."
      ],
      [
        -0.9791,
        "this app makes my listins on depop look soooo good @happyrecycledgoods for proof 💜💙💜💙 🥲 the all is so easy to use and very cheap compared to similar apps that offer less ease of use"
      ],
      [
        -0.9872,
        "Wanted an art app that uses AI to produce original art work using actual digital tools BUT I'm so glad I tried this anyway. Although they aren't technically original by me the artist works, this app is so much fun and interesting and can give a lot of voices a platform to express themselves in an incentive way. Really fun app with a ton of potential. Thanks, I love it!"
      ],
      [
        -0.9871,
        "Awesome app! it's one of the best photo apps I've used! That being said I think an option for extended time for \"creation\" would be extremely beneficial. Sometimes It will produce pictures that seem to be nearly finished and if it could have ran an extra even 5-10 seconds it would have turned out so much clearer. Still I think it's a great app! Great ui, super easy to navigate and very quick and easy to learn to use 10/1!"
      ],
      [
        -0.9866,
        "Look, I'm fine with ads and a 'pro' option to unlock a few fancy brushes, but the amount of interrupting ads is SO unnecessary. Every other save I get an ad. This would be ok if it weren't for the fact that many ppl have to save MULTIPLE TIMES A MINUTE because this app is prone to crashing on mobile. I'm really glad I've started using krita more, it has no ads and a nice customizable layout :) 1 really good thing about this app though is the fill tool, It's pretty good."
      ]
    ],
    "top_women_negative_reviews": [
      [
        -0.9644,
        "Pathetic! Used the app for around 1 month after which I am writing this review. The app has many exciting features, so thought of buying pro but it is hands down the worst application when it comes to execution. I have used this app on two different phones, it keeps on crashing after a minute or so. It is so annoying and irritating. Have tried everything to get rid of the issue, but to no avail."
      ],
      [
        -0.9463,
        "I paid for the premium version. I like the minimalism of the app, but in a few ways it has failed me. One, it doesn't auto save. Which is extremely frustrating. Two, you can't rotate the canvas as you draw, only zoom in. Three, you can't drag the symmetry tool to anywhere except the dead middle of the page. And today a piece I have been working on \"failed to restore\" when I had saved it multiple times. Expected more."
      ],
      [
        -0.9461,
        "It wont save my artworks. I spent so much time on certain drawings and now it just shows an error with a blank page. All my work is lost and there is no way to recover it. There isnt even a save fewture in the app. If i export my drawing sometimes it just shows an error and the drawing does not save in the gallery. One of the worst experience with an app which has so much potential and great features, whats the use if you cant even save it"
      ],
      [
        -0.8954,
        "video sound is few seconds forward,no reply from costumer service .I have tried to make another project and still the same problem.Before downloading it looked right but after it's completely different, some pages are blank or missing too.I have tried to sort it out in different ways described on the app but still no change. So disappointed as when you pay for something you expect something back."
      ],
      [
        -0.9049,
        "The brushes are HORRIBLE everytime I draw a straight line, IT GOES CURLY BECAUSE OF THE Brush and every SINGLE brush does it. Another thing,why does everything have to do with the trial? The layers you have to BUY which is horrible because how do you expect artists to draw with 1 layer? It's a REALLY bad app so please don't use it it's nothing like the pictures. I'm uninstalling."
      ],
      [
        -0.885,
        "This app worked better in the past. I spent over 4 hours editing a template for my website. None of it was getting auto saved. It won't give me the option to download my finished files.. Even when I manually went in to save each part I worked on, it was still not saved. Idk what's up with this app, but I'm pissed. So much time wasted. And I upgraded to pro. I have the latest update, so idk."
      ],
      [
        -0.9153,
        "**keeps crashing** I loved this app, I've been doing digital art for the past 6 months and this app was perfect. The only thing is that recently it's started crashing... it's happened before in the past but for the past week it's continued to happen. And it's been lagging so much to the point that I can't even draw simple things. It's so frustrating because I haven't been able to get through 5 minutes on the app before it crashes or the lagging is so bad it messes up what I'm working on...."
      ],
      [
        -0.8831,
        "Not the best at all. Lost track of my paper and I couldn't hold and trace because it was difficult to draw and hold a phone at the same time. If you look up jazza on youtube you'll see exactly what I mean. I installed after seeing his finished drawing but its not worth the stress and frustration to get to the finished product. And it started taking random screen shots from my device FIRST and then popped up with the privacy and terms afterwards. Not comfortable with this app whatsoever."
      ],
      [
        -0.8922,
        "I bought subscription of 1 yr since then faced lots of issues. But no answer from their end. Before you buy their services they call you several times. But once you bought their services, no one picking up calls neither they reply you. Pathetic service. Don't purchase anything."
      ],
      [
        -0.8395,
        "The app is purrfect for Samsung devices, smooth interactions. The only problem is limited brushes and diverse options unlike procreate. Please do add moree brush set and features!! Edit: live drawing and all that stuff will not help me with art now will it? I need BRUSHES! B R U S H E S! I was using other apps that had those features but the apps were lagging cus samsung does not support any other drawing app other than its own"
      ]
    ],
    "top_men_negative_reviews": [
      [
        -0.9726,
        "I bought the full version of this app and all features years ago. Along with the Infinite Painter app. BOTH were awesome but unfortunately I have had multiple errors with Infinite design recently. Just in the last month I the app failed while trying to work on a project that is much smaller than others I have done with this app in the past. The first error locked me out and didn't recognize me as a paid user, which I have been for a handful of years. I had to re-install the app to get it to recognize my credentials. Perhaps my bad, but the uninstall process took with it my saved projects that weren't exported to SVG or PNG. Those were gone and unrecoverable. I started the project over again and near completion most of the layers I had cleared themselves and hours and hours of work was lost. I have reached out via their email because their forum won't let me create an account and they basically gave me a response that sounded like it was blaming me for their apps inability to function. It pains me to walk away from Infinite Design. It was the best Vector drawing app but 2 losses in a month and a loss at the end of last year has taught me I can not rely on this app for projects anymore. Apart from that some of the functions in the app have started to work differently or fail over the years. I wonder if there is enough upkeep. Using the lazy function or smooth function don't work as well as they used to. I was down to drawing my lines by hand in the app when I wanted them and exporting to SVG to clean up in a program on my PC. I hope this changes for the future."
      ],
      [
        -0.9542,
        "It was really a bad experience. Waste of money and time. I purchased PRO version but after 1 week the app is not working properly. It's just loading. No even support is working. And you will not be able to make your video. REALLY DISAPPOINTED!!"
      ],
      [
        -0.9433,
        "The app is easy to use once you get used to it but when I do more than one sketch at a time it'll say \"Oops failed to open image\" -update- when it fails to open a drawing it's because the photo has been deleted in my gallery but there is another problem. The options for text is very limited on mobile devices so it doesn't fit with the drawing and I have to write it out but that doesn't look good either it would be nice if there were other fonts"
      ],
      [
        -0.8667,
        "Wasted money. I have no idea why two weeks after I still cannot save the project to the gallery. It's annoying you know"
      ],
      [
        -0.9457,
        "So looks like I paid for premium features but then there is now a subscription!!?? I have to pay again and monthly for something I already paid for to have premium features, I guess I'll be going to a different drawing app!! 😤 And it doesn't always auto save, if you don't press save and the app freezes and your forced to exit then come back you won't have your progress saved!!!!!!!!!! What a waste of time I spent drawing something"
      ],
      [
        -0.9173,
        "Hello! In my opinion this app is mediocre, the brushes are ok, but most of them aren't very good. Most of the brushes you have to pay for, you only get around 4 for each category. The design of the toolbar is ok, but I don't like that you have to tap on it everytime you want to use it. The undo, the undo is very annoying, 1:it is in a place that is hard to access, 2: you have to pay to get more undo. That's not very user friendly, undo is one of the most nessarray tools for an artist. Thanks!"
      ],
      [
        -0.7351,
        "The app is currently broken for me. Drawing is just impossible. The actual action itself is being done but adds these fat black pixels around what I've done. But, wait \"Why not just erase it? Because, the exact same thing happens with those black pixels. They just appear and it ruined the piece I was working on and I can't continue on it."
      ],
      [
        -0.8621,
        "This is the worst NFT marketplace in existence. The blockchain technology is so inferior beyond imagination. It sometimes takes hours to freeze metadata of just 1 NFT as you keep retrying with error! Furthermore, your JPEGs are not safe at all - anyone can right click and open a full size image then save it. Simply aweful platform."
      ],
      [
        -0.8303,
        "This is the worst app, won't let you create and all the ads that say you can upload from your phone to the app is all liars, because they don't show how many mb they have because it say on here you need 100mb but phones have kb and photo should be added but nobody can't do from this stupid add because they won't fix the problem on their app"
      ],
      [
        -0.9287,
        "The library is undoubtedly overwhelming BUT all the video templates are useless if the user doesn't have the freedom to edit it properly. I'll point out just a few holes. 1. No option of exit-animation at user's chosen time, for either text or photos 2. No option of sound effects like fire, wind, clap etc. 3. why do we need to split pages to bring in text/pic. Let the user pick any time in the video to introduce text/photo/entry or exit animation"
      ]
    ]
  },
  "books": {
    "total_reviews": 520,
    "total_female_positive_reviews": 205,
    "total_male_positive_reviews": 168,
    "total_female_reviews": 277,
    "total_male_reviews": 243,
    "top_women_positive_reviews": [
      [
        -0.9921,
        "I had initially only rated the app and not written a review but it really deserves one. It has a nice, clean interface that makes reading various kinds of books and documents very easy and enjoyable. It has a few tiny features that can be improved but then this app is constantly improving. Thank you for this completely amazing app and the effort that goes into updating and improving it while keeping it free."
      ],
      [
        -0.9915,
        "Exellent app!!! Even though not all the books are free, the free books are also exellent. And many books are also at a cheap price; i was so not disappointed! If you are looking for book apps, you've come to the right one!! The features are also pretty cool, simple. Love this app.. ..i use it every day! 😊😊👍👍😎 The only slight downside is that i wish more ebooks would be recommended for me. It's like, 1 book in 2 days. It would be much better if it was maybe 3 or more books a day."
      ],
      [
        -0.9909,
        "This app is really amazing. I have installed a lot of apps to read stories but wattpad is the best one ever. It creates a very good platform for the people who are interested in writing. But I still miss those days when I was able to read stories without ads. Those days where a lot of books in my library where available to offline but now I cant(ofc yes for people with premium). But still this app is the best with various different genre stories. Over all this app is amazing. I love it."
      ],
      [
        -0.9841,
        "Pratilipi was really good reader aap before pratilipi premium. the coin system you've introduced. it doesn't work properly for pratilipi premium. I tried so many time to unlock next story parts but it doesn't work. stop advertising please buy our premium pack. if I ever need it. I'll definitely buy it. but not like this. It's a great that writers can earn from their writing but please we readers want to enjoy reading as well. please developers keep that in mind too. thank you."
      ],
      [
        -0.9577,
        "I love it I haven't read an actual book in ages I mostly read Harry Potter fanfics or others similar /connected. The stories are a dream too read and I can't get enough absolutely love them especially the darker ones 😉😍🥵🖤"
      ],
      [
        -0.9856,
        "Such a good app . It helped me to find a new way of learning through reading. I think its a best choice for those who loves to reads fiction,biographies , history or anything. There's also option to choose the type of book need and also we can change setting at any time ,can add name,photo and can select the languages. Superb Loved it 💖💖."
      ],
      [
        -0.9867,
        "Awesome app, i wish I could give you 3000 stars. I finished reading a whole book from it, and I am not much of a bookworm though. The mode of flipping page horizontally makes reading the book more fun. It's fun to use bookmark, and the one thing which i absolutely love about this is, that they can save your page history, an you can clear it as well, so if I didn't just put a bookmark i can still go to the right page. Awesome work developers. Cheers ✌️"
      ],
      [
        -0.981,
        "The convenience of having a Kindle is my favorite part of having it. Any book, magazine, etc. available at my fingertips any time. Kindle is also innovative, always adding new features & staying up-to-date with technology. A favorite feature I still love is being able to highlight favorite passages. Another favorite feature is being able to look up unknown words' definition. There are truly so many reasons to love a Kindle."
      ],
      [
        -0.9774,
        "I love that I can read my school textbook from Kindle. It's easy to highlight the text and search for your highlights - this is perfect for taking tests. You can also write notes and create flashcards. Kindle even recommends popular high lights for the topic. But the best feature, in my opinion, is the ability to link Audible with the text and have it read for you. This is great if your pressed for time."
      ],
      [
        -0.9524,
        "The app is generally well designed, but is completely unusable as the image constantly shakes and jitters, even after calibrating the compass and holding it perfectly still. Please fix this bug ❤"
      ]
    ],
    "top_men_positive_reviews": [
      [
        -0.9908,
        "Best reading app so far with no annoying ads love your free app initiative. Actually i encountered a bug while reading a specific book i love to read, whenever i select one of the chapters in the contents menu i always get dragged to the first page of the book i don't know why but this only happens with this specific book it'd be a great help if it could be resolved. Otherwise a great app so far, no complaints🙂. Kudos!!"
      ],
      [
        -0.9849,
        "The best app to listen to Marathi and English audio books at a very affordable price. This is the only provider that has wide variety of Marathi audio books that I was not able to find anywhere else. I was only interested in Marathi books and recently Storytel added a subscription option for Marathi only content at even less monthly subscription price. That's really awesome. App is also good, never hanged or created any issues. New audio player is better than last one and I am sure the team would be improving the player further. Short stories are excellent and there are frequent new releases. These are really good if you want to have a quick fun read/listen and lighten your mood or learn something new quickly. Statistics section is also good to understand your listening habits. 5 Stars for providing us with such a good variety of audio books and podcasts. Few things that can make the app better 1- Support for web based player so that we can also use it on PC. 2- Pause the audio when there is a notification on mobile. The app currently keeps audio playing in background if there is a notification. Most of audio apps pause the audio and after the notification sound, resumes the audio 3- Increase library content for latest English audio books (there are review or summaries available for latest books but feel that there is lack of latest English content compared to other providers). 4- Separate section for podcasts and books. Right now podcasts are mixed with books which for me is bit confusing. I start listening thinking that it is a book and then realize that its actually a podcast 5- Maybe have a modern color and look for the app. Current app works great, but looks a bit outdated. Also add support for light and dark modes 6- If possible, add option to buy books so that we can keep them forever and can listen to them anytime later even if the subscription expires. Also, search feature needs improvements. If I search for something, usually there are no results. Every time I have to depend on the curated lists or book tips section to find something that I would like to listen."
      ],
      [
        -0.9855,
        "Amazing, it's completely free AND opens almost all formats! But: 1. I wish I could search in text without having to wait for the book to load itself, 2. Search in-text for books only in a certain collection/series/by a certain author etc. would be really useful. 3. Sub-collections would be useful, collections in a main collection. 4. Being able to change covers. 5. Batch-editing. 6.This app would be so useful on windows, it would be even better than adobe's reader! It already is on mobiles!"
      ],
      [
        -0.9673,
        "Reading with Kindle is perfect for me especially with my devotional reading in the mornings and throughout the day. The best part is Kindle does not need WIFI to operate so you can read anytime and anywhere. Books on Kindle are also discounted, so if on a budget, purchasing power is increased. Kindle is quick, it's easy and it holds your access to many books in one place on one device. My Kindle library is full of my favorite books to enjoy at my leisure."
      ],
      [
        -0.9847,
        "1. I use this fantastic app for reading the pdfs of different genre of books as it has various option to sort them and form your own kind of clean and clutter free library. 2. This app has amazing interface and all the tools that will enhance your reading are present. Such a delight to read, underline, save, bookmark and what not! 3. It works without internet and ads free experience. As an avid reader, I have tried almost all the apps on playstore and found it best. ❤️ for it's developer."
      ],
      [
        -0.9784,
        "The app is pretty decent, but I think a huge missing feature is being able to cast the audio to a Chromecast, hence the low star rating. It's a very important feature to me for any media app. We have a full home audio system, it would be great to be able to properly cast and listen to books while doing chores without casting my entire device. Another nice addition could be made to the sleep timer. Love \"End of Chapter\" but a \"End after X chapters\" would be great!"
      ],
      [
        -0.9824,
        "I love this app! Yeah, there may be the occasional annoying glitch when writing, but I've used Wattpad for several years now. There are so many good books, and its great to read and write, chat with people and have fun! Though the update is weird to me. I liked the old logo better, and it has no indication that you posted an update or a new chapter, please put a button like before. (OR AT LEAST MAKE THEM VISIBLE) Also, whenever I go from my library to my private messages, it kicks from the app."
      ],
      [
        -0.9298,
        "You know I absolutely love this app. I've had it for years. It's easy to use, it's fast, and it's great overall but I have two thing I would like to see updated. 1. The ads, I don't like being bombarded with ads after just reading one part of a story. Its just to much. 2. I would like to be able to see who is reading my stories and when they read it. I want to know who's reading them so I can tell what they like by their reading lists so I can change and make my stories appeal to them more."
      ],
      [
        -0.9582,
        "The kindle app is amazing especially for someone like me who likes to listen to books in the car rather than music most of the time. And I would recommend paying for the service monthly as most of the books become free when you do this instead of paying for each book individually. The only complaint I have is that I wish all the books had an audio version for when im needing to be hands and eyes free."
      ],
      [
        -0.9708,
        "I love reading on Kindle apps! You can make the print bigger or smaller when you need it, highlight text in multiple colors which can later be used for quick notes review or exported to quote in presentations, have all your favorite books accessible on all your devices from anywhere or at any time, be able to purchase (or download the free specials) the most current or classic books that interest you at the click of a button, and organize them in your library your way. It's a reader's dream! ❤"
      ]
    ],
    "top_women_negative_reviews": [
      [
        -0.9575,
        "I'm using this app since 3 years it was good but now it's getting worse day by day. When ever I open the next part or story it just keeps on buffering ,Pathetic. I can't read stories as part by part at one time ,everytime I have to reopen the app again & again to read another part which is very irritating.I think this is all because Pritilipi wants us to subscribe their app ? Disgusting 😡😡😡😡😡😡😡😡 If anyone wants subscription then only you download this app otherwise this is irritating."
      ],
      [
        -0.9449,
        "Day by day it's getting worse. It is all about money. Subscription feature is nice but don't force the readers to pay. Premium feature is not at all good because there are children reading the stories. They have no income to pay. Parents won't allow thwm to waste money for this. I was using the app for 2 years. You just wrote in the description it is a feee app. Just don't say if you don't want to support the readers wait for a day. Reduce the amount. Make it affordable"
      ],
      [
        -0.9225,
        "The player has always had problems running. At first it would shut down when using the navigator every 10 minutes but now even with the app up front it won't run for more than 20 seconds before turning itself off. When it first got really bad beginning April I found many others were having the same problem and there were some fixes, none of them worked. Been waiting for Audible to do something about that but it doesn't look like it will happen. Now they are limiting purchasing which I'm guess..."
      ],
      [
        -0.8765,
        "I have been using this app for more than 4 years, but the new update for some odd reason has made the stories available offline have the last page of the chapter repeat itself before one can read the end. Please fix this issue cause it's damn weird and just a waste if time trying to figure it out."
      ],
      [
        -0.802,
        "perhaps the only problem i have is the amount of ridiculous ads. the only way to remove this factor is to pay (won't do) and to add the book to offline library and turn off the internet for no ads. there is also a problem with other websites (riddled with viruses sometimes) stealing works, novelhd is one example, and i would like wattpad to comprehend this and work on it. other than that, it's a nice place to share your works and connect with other writers."
      ],
      [
        -0.8937,
        "i really really love this app but will all the updates i think it's gone down hill. also don't know if it's just me but sometimes pages will repeat themselves or words from a story will be cut off so i'll have to leave and reopen the story AT LEAST 2 or 3 times. I've reset my phone, logged out, even uninstalled the app and reinstalled it so many times i've lost count and the previous problems i've mentioned still haven't been fixed. i write on here myself and it hurts to give it three stars."
      ],
      [
        -0.9013,
        "No doubt it very nice app who keeps reading stories...generally I don't take time to edit my review but now I am doing just because there is continuous notification problem. I felt so worst about it because we step in to pratilipi to get some relaxation but now there is no such way it seems...I faced notification problem for so many times within a very short span of time...please work on this and try to never repeat it"
      ],
      [
        -0.8237,
        "Very complex, with so much information. MY COMPLAINT is how user UNfriendly I find it at editing tree information. Very frustrating. Overly time consuming."
      ],
      [
        -0.7495,
        "Overall a good application for readers. But one thing I find irritating is the Reading mode reloads again and again and it changes the page I was currently reading .So I have to get back to that page again. It's very problematic and irritating when page formats change. Please resolve the issue."
      ],
      [
        -0.7608,
        "No matter what I do I cannot access the store.... it just stalls and then tells me something went wrong try again... updated and restarted phone and could access for a few minutes then back to same issue.... so annoyed"
      ]
    ],
    "top_men_negative_reviews": [
      [
        -0.9893,
        "I've been using this for a 5 or more months and I must say that it was good but I have a problem with it and it was so irritating there was a LOT of ads! can you just remove it?! We don't need them! In every chapter there were ads. Damn it! It was so damn irritating! Useless Ads. We don't need them in our life we're not enjoying it.. it wasn't satisfying it was dumb. Please! Remove them.."
      ],
      [
        -0.9817,
        "I signed up for the 14-day trial subscription. I did not find it's good for me. For the test I had to provide my card details. But the app doesn't give you the option to unsubscribe, not even in the playstore you can cancel. Now they charge me $191.40 AUD, for a one year subscription, of something completely useless to me, 1 goddamn year! Careful guys, this for me is a kind of scam, I'm extremely angry! I deeply regret ever hearing about this company. Give me back my money!"
      ],
      [
        -0.988,
        "This is too much 😠😠😠😠 I have a advise to the controller of this app , why don't you check your system???? Occasionally there is a problem with it, why don't you check it??? We are suffering man!!! We can't see any part of stories, any updates and nothing. And the biggest problem is I can't see the profile of my favorite writer, not only this also can't find any of her stories and can't message her any more to inform this problem 😡😡. If your system is defaulting then stop this app😠😠😠"
      ],
      [
        -0.9427,
        "I am a longtime subscriber. The app got bad suddenly. I started getting an error saying 'Something went wrong' whenever I click on anything inside the app. Unable to listen to anything. The app became useless. Uninstall, install didn't help. Something seriously is wrong with this app. Will give back 5 starts once the issue is fixed."
      ],
      [
        -0.9093,
        "Audible app use to be perfect, but they have slowly removed more and more features, making it nearly entirely useless. Basically, you need to purchase titles on the website and use the app to only listen to the titles. Even trying to find titles in your wish list is difficult. You get a free book every month, but you can't find it in the app. You can't even see best seller listings anymore. You can't purchase books anymore on the app. Utterly useless and completely unacceptable!"
      ],
      [
        -0.9253,
        "Laborious and frustrating. I mistakenly purchased an ebook instead of the audiobook, I asked for a refund and it was rejected. The refund process is vague and does not allow a dialogue or a specific reason to be entered, there is no clear way to communicate with anyone and you are sent round and round in circles. The whole experience has left me frustrated and confused. Perhaps Audible is the better option."
      ],
      [
        -0.9353,
        "Worst books app EVER! I will never buy a book from Google again. App cannot keep track of your spot in ebooks and stops with audio book playback every few minutes. It once was great but Google has destroyed the basuc functionality. I have to bookmark every time I stop with an ebook and constantly have to keep waking my phone to continue audio book playback. As a user of many Google apps, I have unfortunately come to realize that Google doesn't care about users and their app experience."
      ],
      [
        -0.8851,
        "It seems like the convenience of an app has been lost on the developers at Amazon/Google. I have no idea whose decision this most recent update was but it's awful. We can no longer choose to purchase books with a card on the app. If you want to even know the actual price if a book you want you have to go online to the audible website. This app has slowly become more and more user unfriendly and I'm disappointed. I hope anyone considering getting the app sees this and decides to go with another."
      ],
      [
        -0.9046,
        "This app is absolute trash. It's basically no more than an audiobook player and a library with really poor search facility, not user friendly and poor functionality. You can no longer purchase books, you can't tap on the author or narrator in the description to take you to more titles by the same people. You can't make adjustments to you own details. I never ever use the website. EVERYTHING I do is via the app, I'm not logging into my account every time I want to do something. Absolute trash."
      ],
      [
        -0.7548,
        "Has some serious usability issues. The main problem is the way tables are rendered on a small screen: they're very difficult to scroll horizontally and the rows cannot be sorted by column. Also, when editing an article, this app trashes edits, without warning, if a browser or other app loads another article. Finally, the inability to pinch zoom images drives me bananas."
      ]
    ]
  },
  "communication": {
    "total_reviews": 2000,
    "total_female_positive_reviews": 569,
    "total_male_positive_reviews": 761,
    "total_female_reviews": 876,
    "total_male_reviews": 1124,
    "top_women_positive_reviews": [
      [
        -0.9937,
        "As l experienced, this is an amazing app. It's just so easy and simple to send the messages to my friends. It also have many cool features. It doesn't has any ads and doesn't require any premium subscription. It's a pretty popular and useful app nowadays too. Additionally, l didn't faced any problems with WhatsApp since l downloaded it. However, it gets better and better at every update. I'm really happy with the application which made messaging so easy! ☺️"
      ],
      [
        -0.9914,
        "I am surprised to see how fast it is when it comes to downloading stuff. Not so slow but it can be better if you can make it use the full speed of a wifi or network by force and add a limiter like opera gx. Everyone loves this feature. Also cool interface. Absolutely recommend. Also, adding a bit of short tutorial about what you can do here will really make it easy to use. I hope it gets way better in the future. Good luck!"
      ],
      [
        -0.9858,
        "The picture quality could be a lot more clear but I like the extra features like how I could draw on top of the video or put text on it if I wanted to and can turn the camera around to share the sunset in a voice-mail to my boyfriend which I thought was pretty cool since obviously he couldn't see it in person. The only thing I would say needs improvement is the video quality. The sound quality was good though, however I'm not sure if the credit for that goes more to my cell service provider. Thx"
      ],
      [
        -0.9863,
        "Had a great and wonderful experience with duo. Not a single problem with it so far. Lol. The picture and sound quality were both great. The picture came in clear, not blurry & fuzzy looking and a lot better than expected unlike other apps and the sound was crystal clear and wasn't distorted or in and out like other calling/video apps do at times during a call. I think the majority of those who try out duo will be very pleased too!!"
      ],
      [
        -0.9878,
        "Hey guys, devs, everybody. Amazing job so far! Really, love y'all. The features provided are top notch and service is amazing too. No complaints here. Just, there's an issue I've been having for a few days now. The voice command features for answering a call or rejecting with or without a quick reply isn't really working for me. I'll admit that I hadn't payed attention to that feature before, but i tried it out this week and got a no-go there. I dunno what's causing this, any help from the Drupe team would be much appreciated. Also, after having temporarily halted my activity of the app for about a week or so, I noticed, upon resuming, that the proximity sensor for speaker and handset function were also showing issues. Again, much thanks for any help and great job guys! Keep up the good work."
      ],
      [
        -0.9854,
        "Great App. But when we are clicking photos to send it to somebody, it should capture the photo also when we press volume up/down button OR the finger-print scanner. That would be a Great update and would make capturing photos easy. I apologise for giving a 1 star, but I did it in the hope that my suggestion could get the developer's attention. I will modify my review and make it a 5 star if this feature is added. Thanks. PS: Thanks for adding the feature!"
      ],
      [
        -0.9728,
        "Duo is the best! I love it because you can make calls, video chat, send videos, send audio clips, you can even write on the screen and send pictures. I love sending videos of myself talking. Its so easy, especially if you don't have time to call someone or type out a text. You can watch it yourself and redo it if you don't like it, and the amount of time you get for each video is alot. I definitely recommend this app. With so many options, you can't go wrong."
      ],
      [
        -0.9737,
        "To be honest its all on the processing speed of the user's phone and internet connection. The moment I purchased a good phone with reliable service I've never had an issue. You should always delete it when your done, including anything you downloaded while using it. It's a great experience if you know what your doing. Most people dont even use all the setting properly. I love this and love how it doesn't even have to be a third party app. Gooood orbot!!!!"
      ],
      [
        -0.9845,
        "I would rate 4.5, but only whole numbers are allowed. The option for persistent address bar and tabs is very welcome, something that firefox now lacks. Built-in dark mode, instead of an add-on is brilliant. It's very fast and seems quite light while using it. Love the fast scroll handle, it just needs to pop up quicker and have an option to change sides. Edit: Bookmarks are now a lot easier to use and the ability to add a function button to the address bar is great (desktop mode for me)."
      ],
      [
        -0.9872,
        "I'm using it as my Default Browser⚡ In love with the dope interface, it's super smooth to navigate throughout the app, thanks to the Mindful UI Design (it's so cool futuristic, love it XD). ad-free, satisfyingly stable and perfectly minimal. It would be convenient if there was an in app dedicated feedback/suggestion page link.✌🏻"
      ]
    ],
    "top_men_positive_reviews": [
      [
        -0.9925,
        "Overall a pretty good app to chat with family and friends.... But it would be really nice if you could like add a feature of grouping chats... Like grouping chats of family... And grouping chats of friends.... Like you know on phones like you drag an app into another app and it creates like a folder and you can rename this... This could improve overall management for a user with lots of groups... Viber I hope you will consider my idea... It would be a really nice feature.... Overall nice aap...."
      ],
      [
        -0.986,
        "For a Google Developer you can appreciate the same experience they have when you are interacting with they Services using this browser... A guarantee to be updateded everytime we have something new, and not always is relevant and we booth try our best to satisfy each other with more improvement then we expected... 😏💖🙋🙇 But ok, let's open again and maybe, I will notice something inside that new update. Keep doing your best guys! Good work to u All 💖"
      ],
      [
        -0.992,
        "Super lightweight but functions perfectly! This is exactly what I needed on my old, beat-up phone. I like that you can easily archive messages and I like that it has a quick reply pop up. The only small thing I'd like added would be the ability to more easily open the full conversation from the quick reply. But that's a minor complaint, you guys did a great job! Thanks for keeping it small and looking great on night mode."
      ],
      [
        -0.9849,
        "Fast,and data efficient but the loader on top makes it look like it's loading from a browser.....it would be nice if it were replaced with an ease-out transition....dark mode would also be a great fit .... Kudos to the developers and keep up the great work."
      ],
      [
        -0.9808,
        "I really love this app,i have been looking for a really fast browser until i found hot browser which had the highest rates. Its really fast,user friendly,and easy to use. This app is amazing✌✌✌✌✌"
      ],
      [
        -0.9899,
        "Lightweight strong browser; really like it! I've used it for 5 weeks now, with complete satisfaction. A really useful, good app! Thanks to the efforts of developers, I continue to enjoy the marvellous browsing experience with Phoenix..! The updated browser keeps getting better, with scores of helpful services.. Though the ad blocker is less effective on free music sites, it still helps a lot in peaceful browsing and quick downloads. Keep it up!"
      ],
      [
        -0.9865,
        "Been using for a long time now. Best messaging app out there, for me. It is not as easily portable from one device to another like WhatsApp is. But otherwise, there is nothing to worry about. I use it mainly to message only one friend, but extensively. Great interface, good quality video and audio calls. Very reliable and can be accessed securely from other decices as well. Love the stickers, by the way."
      ],
      [
        -0.9808,
        "It's really good, the best thing about it is that we don't need to share our phone no. like WhatsApp, also so many channels, chat groups, bots and a lot of useful features are there that's great. I only have one request if you could do it plzz when we are recording our voice messages there must be a pause button also, since sometimes we mess up and we gotta record everything all over again. So that would be great of you add this feature too. Otherwise, Great app! Loved it!"
      ],
      [
        -0.9769,
        "Ok but not gmail. The only way to improve Yahoo mail would be to have it be able to link to other apps in order to make attatchments easier. In short take a look at gmail and all of its features and benefits, then get to work. Your better off designing an app that does something that Google hasn't done already. Be original in your chosen path, don't try to keep up with the Jones's, be bold and carve your own path offering services and Apps that provide a solution to something that's trending."
      ],
      [
        -0.9778,
        "A useful, highly functional and user-friendly smartphone browser. Worth the usage, for searching & finding, adding sites to your own collections & saves, navigating around the mobile Web and research, and some fun. I can recommend Microsoft Edge app better than a cellphone network app which asks whether I would recommend the network to others, on a scale of 1 to 10 likeliness (1 low, 10 high). Good on smartphones, better on tablets and best on laptops & PCs. Thanks Microsoft!"
      ]
    ],
    "top_women_negative_reviews": [
      [
        -0.9728,
        "I love QKSMS. So simple with just the right number of options. But there is a bug, at least with my S21 Ultra running Android 12 and the latest version of QKSMS available which is V3.9.2, last updated Feb 2021. This is not a user or device issue. In QKSMS Settings, if you choose to use any Blocking Manager other than QKSMS, all the notifications stop working. No Notification Sound, No App Icon Badges and No Status Bar icon for new texts. It took a while to figure out what was causing this. I can run any other messaging app and the notifications work fine. This bug is important to me because I want to use Should I Answer as my Blocking Manager. It is one of the choices in QKSMS but I can't use a messaging app that does not notify me. This is a critical issue in my opinion. I've written the developer 4 times and he has yet to reply. I have a bad feeling there is no one supporting QKSMS."
      ],
      [
        -0.9697,
        "Really useless app. There's no call history linked with a contact. If I want to see a call history for a contact I spoke to 3 weeks back I can't find it unless I scroll through a 100 calls or more . There is no bulk contacts delete option. If I have to delete 20 contacts I have to do it one by one. Worst app ever. Google message app is just as bad. I get notifications for every blocked number sending me spam. Really really pathetic service. 👎"
      ],
      [
        -0.9518,
        "Recently, gets into a state where a message is displayed without a way to get back to the message list. Sometimes 2 messages are displayed, one on top of another. Weird! Still having problems. Gmail gets into a state where a message is displayed with no tools above to go back to the message list or anything else. Killing the app and restarting it reenables correct behavior. I've had this problem for over a year. Not good! I have screenshots showing the problem."
      ],
      [
        -0.9529,
        "Can't send more than one attachment at a time. Can't forward media messages (no idea why, but they always fail to send). Messages frequently fail to go through. Messages fail to be received. In summary: an app with massive potential, but always plagued by bugs that lead to instability and low reliability. Pass on this app for now."
      ],
      [
        -0.9556,
        "What a terrible, scummy app. Apart from its telemetry gathering being, supposedly, less than the full app, but still being enormous (and for a simple messaging app even more so) - the app is downright fraudulent. I accidentally sent a message to a wrong group, went and deleted it asap, and thought that was it, since the app itself alerted me that the action was irreversible. Little did l know that the app merely hid the message from me, and didn't remove it from the chat altogether. Horrible."
      ],
      [
        -0.9496,
        "I store contacts in my sim but unable to remove them from my device. Even when I try to delete a contact they keep telling me \"error saving contact\" It's terrible. As of now I'm unable to delete any useless contact from my phone. Even restarted the phone to no avail. Please I would be happy if this problem is addressed. I can't be stuck with useless contacts forever."
      ],
      [
        -0.8735,
        "Hands down the best app to use in slow internet connections. Best app to use when travelling to countries with slow and restricted internet. On low data setting... this app out performs everything else I used. The app does have a few annoying bugs.... but it is a small price to pay... when other apps fail due to connectivity issues... this app performs... Update. This app went downhill in the last couple months. Video chats no longer work. Calls don't show up... always shows me a missed call."
      ],
      [
        -0.9506,
        "I've been using the app since many years and always found it simple to use. But the latest update has annoying bugs that must be fixed - 1. I only see missed call notifications now when someone calls, my phone doesn't ring (mostly) 2. There's something wrong with Whatsapp Backup. Despite a good wifi speed, lately, all backup attempts are unsuccessful."
      ],
      [
        -0.9086,
        "This app crashes or lags a lot. Whenever I use incognito tabs after opening two tabs it stuck there, can't close or open one or can't select other either. Also what kind of VPN is it that can't work with google as search engine ? This app also expands ridiculously in size even more than chrome. I always face the crash issue in same way again or another new way. It just has to crash somehow. Ad blocker doesn't works as it did before. Doesn't blocks pop-ups. It should completely block all ads."
      ],
      [
        -0.8519,
        "I accidentally uploaded a wrong picture on my status and the picture automatically downloaded in the phones of the people who viewed it, leading me to a huge problem. The auto-download feature is literally a threat to our privacy. I request to update the application and disable this feature, or delete the video or picture from other's phones memory when anyone deletes their status."
      ]
    ],
    "top_men_negative_reviews": [
      [
        -0.9804,
        "I've been a daily user for 10 years & have survived every crazy update... but this one has been THE WORST. So many issues with it, but these are my top 2: The delete feature in the middle of the screen means everything gets trashed by accident. Terrible idea! The front facing flash is useless now?? It's not even a flash anymore, just a glaring bright light that is obnoxious to everyone around. There's no way to be subtle, so I have to just send black screens. Totally ruined the purpose."
      ],
      [
        -0.9712,
        "The transcription is amazingly accurate. But the lack of a couple of basic features is mystifying. 1) ability to pause transcription 2) storing and accessing transcriptions. 3) some quick punctuation buttons Upgraded to android 12 icon was missing. Couldn't enable it from the app in the 'apps' section. Had to eventually find it under accessibility. Leave things in the damn app drawer Google. FFS fire your UI managers because they keep making bad choices"
      ],
      [
        -0.9631,
        "I noticed, prior to the last update; while surfing the internet with this app. It abruptly tells me to close the app even in the middle of very serious research works. Was forced to think i needed an update to fixed that, but was totally wrong because after the update it went from worse to worst with the display of this error message ( operamini isn't responding,close it) Please do a thing about it thanks My best browser 🔥 🔥"
      ],
      [
        -0.9624,
        "Yahoo Mail used to be great, but the last year has been total frustration. Near every time I try to open an email the rotating blue \"Working\" ring just sets there on the screen rotating. To get the email to open I have to close out Yahoo Mail and restart it multiple times. I am considering going to Gmail completely and dropping Yahoo Mail plus. I have been with Yahoo Mail since the 1990's. It's a shame they have screwed it up so bad."
      ],
      [
        -0.9367,
        "Works well and gives notifications for emails that bypass the inbox which is nice and what I'm using it for. Held back by a lack of customization, especially in swipe commands. Also there's ads but no way to get rid of them? Where's the option to pay to remove them? This is a huge irritant that just makes me want to stop using the app. EDIT: the forced ads have turned out Way too irritating to tolerate, moving onto Spark Mail."
      ],
      [
        -0.9024,
        "The worst app ever used..!! Even if I'm connected to WiFi it doesn't show any network... U don't get to know abt the person online status... The files don't get shared easily...takes inormous tym to load the files... Worst thing abt this app is its layout for emojis... Need a lot of update...!"
      ],
      [
        -0.9486,
        "Note : Not auto recording. It's really frustrating, when i record the call it's telling (now your call is being recorded) to both a side, to me as well as to other side also. But your recording option it's not a auto recording, if you give need not to go for a separate app for auto recording. Even though i put separate app, the mute is not working. Totally, I hate this app😠. Total waste 👎"
      ],
      [
        -0.9575,
        "With this update, Samsung made the search/URL bar completely useless and very annoying at that. It does not let you partly pick and copy search suggestions to address bar for further editing before submitting for search. If you want to search for a phrase you have to manually type everything because selection from suggestions will submit it for search. Then, you have to type to search bar again to start over! Very bad mistake. Also, you cannot search for a phrase you searched a few hours ago, search history is also gone. Bookmarks are useless because you can't find them when you type them in the search bar. Instead, it gives you (bad) suggestions as to what you could be typing."
      ],
      [
        -0.9402,
        "This application is either fake as I'm constantly receiving suspicious emails still continuing after my last status which I place in my spam folder report get no help delete and still notifies I still have them in numbers which doesn't reset and I've tried to contact the developer no response and been advised that no one checks these responses and given a further link which isn't helpful time to report to trading standards. recommend that nobody should use this application.its dangerous"
      ],
      [
        -0.9159,
        "I love this app, I can have all my mail in one spot! Easy to use, but I will only rate 3 stars because of ads. I hate ads, they are everywhere. The ads in this app drive me nuts. I accidentally hit them all the time, instead of opening an email I get an ad. Not happy about that."
      ]
    ]
  },
  "education": {
    "total_reviews": 2000,
    "total_female_positive_reviews": 924,
    "total_male_positive_reviews": 670,
    "total_female_reviews": 1122,
    "total_male_reviews": 878,
    "top_women_positive_reviews": [
      [
        -0.9974,
        "This is the best learning app of India ever without any cost.. Thank you thank you thank you again thank you to all members. I like to give 5 ⭐⭐⭐⭐⭐ on this app . There content are designed very good just I recommend my all friends go through it 🙏💞💗💕💕💕💕💕💕💕💕💕💕"
      ],
      [
        -0.9971,
        "I definitely recommend this app for your homework. It really helps you a lot. You can find answers to your questions. If it is there it is very good but if it not there you can simply type the question or click a photo of the question and send it. You will get the answers in some time. I really love it. I had a 10 pages maths homework. I found all answers to my questions. It helped a lot. Thankyou Brainly...😊😊😊😊😊☺️☺️😊"
      ],
      [
        -0.9953,
        "Amazing! Dave is amazing! Daughter loves Dave, Lucas & Ruby! She's watched Dave's story as much as played app & learned so much from both! Dave's apps are her favorites and mine too! His apps are by far the best, none better. A+education & A+entertainment 💯 Little Donks gets so tickled while learning with Lucas & Ruby, she will be giggling so hard, this is the most beautiful & joyous sound Daddy & I love to hear. The love & joy this brings us is perfection! Daddy & I Love our Little Donks ❤"
      ],
      [
        -0.9946,
        "It's the best platform present online to help prepare for neet examination,as it not only consists of experinced teachers who are always supportive but the team also provides with dps to check our understanding and last but not the least but the periodic tests ... And the last thing being the responsible,caring ,and motivative team being present. 🧡❤ The team binds and attracts students and makes us feel the subject which not other platforms are capable of...BIOMENTORS ROCKS!!!!!😌❤❤❤😎"
      ],
      [
        -0.9923,
        "The best app I have ever experienced. Even it is little bit good than VEDANTU app. But majorly both are super fantastic and amazing. Specially features of this app have excited me for its further details and exercise. Best of luck for further upgradations you would bring 'toppr team'. For the one who have came here for review to download this. Full to 💯% suggestions to do it. You would definitely be amazed with its features."
      ],
      [
        -0.9929,
        "The ADS, man. That's really the only downside to this app. I understand it's to help devs get money so people can play free, but it's so excessive, I can't even change the song or answer a text (both of which take 5 seconds) without a long ad popping up. I've also been having issues lately with the Amazon ad where I try to exit the ad and it takes me to Amazon anyway and then I have to repeat the whole ad process. Gotta have less intrusive ads. Especially since the banners already at the bottom. I have been gone for awhile. Came back for some relaxation and the ads ridiculous. WAY TOO MANY ADS. NO LONGER RELAXING. just wish some of the colors were more vibrant. Other than that, awesome! since the last update it freezes constantly and kicks me out. Please please fix this! UPDATED: since the updates I love it! The new pictures and categories are awesome! Great way to relax!"
      ],
      [
        -0.9933,
        "This is a great app it's very interesting for little kids around 4 or 5 but it would be nice if all the stuff could be free because the little ones might wanna be able to play that part of the game and there no able to but apart from that this game is pretty interesting and cool I don't play it but my little cousins do and they love it what makes them happy about the game is that you can dress up characters and play around with the characters aswell so I'd rate this app 5 stars hope you enjoy!!!"
      ],
      [
        -0.9942,
        "This app is amazing 👌👌. You can learn any language with fun 🤠. It is effectively giving knowledge and it is really helpful in language learning. It is surprising that each and everything is absolutely free. It has got great features such as leaderboard, motivational messages, special effects on every streak milestone, reminders at a time which you're most likely to be in the mood and many more nice features. It is so fun that the first time I used it I was completely hooked.Must Download 💎💚"
      ],
      [
        -0.9938,
        "Over powerful experience 🥰🥰🥰🥰🥰 Sir please add a voice chating option with the opponents, also add a follower option, And also add a custom playing option for playing by which we are able to play with our own friends and challenge them to defeat us. It's a request by me to your team Thankyou for providing us such a interesting and knowledgeable application thankyou so much sir."
      ],
      [
        -0.9882,
        "This is probably the best calculator app I've ever tried. The UI is so simple and easy to use. You can get almost all mathematical operators..... From trigonometry , logarithms and exponentials to calculus... Everything is here. Moreover the steps in the solution are very easy to understand. The camera part is good as well though it struggles with some parts like decimals , variables , etc. You also get additional information like graphs for the equations. Must try !!!! 😄😄😄"
      ]
    ],
    "top_men_positive_reviews": [
      [
        -0.9976,
        "Very nice app for revising concepts. Highly recommend app for average student like me. Actually I was an average student but not now because of saathi. 😎😎😎😎😎😎😝😝😅😅😅😁😁👏👏👏👏🥰🥰😍😍"
      ],
      [
        -0.9938,
        "I was very poor in studies till class 9th. But after deeply going through amazing well designed structure of Edurev App, my life has been changed. I remain keen on learning new things and attempting new topic wise tests. It is indeed the best learning app for class 10. It is indeed a great educational and helpful app with great content and amazing student friendly features."
      ],
      [
        -0.9964,
        "Once again very good work by Biomentors team. Thank you for providing such a user friendly app. All things are superb. Even it is better than YouTube. Video runs very smoothly in online mode also. You can download the video. You get the contents in an organized way and very easy to search content. In short this app more than best for NEET Aspirants. Thank you Biomentors team for your hard work😊😊😊😊😊😊😊"
      ],
      [
        -0.9909,
        "Incredible work photomath team! other math solver couldn't run on my phone. But this app runs so good. An yes, the accuracy, even if I miss 2/3 of my sum it can still recognize it(also my bad handwriting). the solves are easy and crystal clear for me but there is only a stop in this plus point streak, if you could add the option to write down and take photos fron the device that would be awesome. Anyways, Best of luck 😄😻"
      ],
      [
        -0.9909,
        "This is fantastic app for check your preparation or learning especially in lockdown good app for online exam.its describe your result in very good manner you can compare your all results....just amazing but one thing is not good that students can cheat very easily between exams .so, I think that please improve it. Otherwise it's too... good😄😀👌👌👏👍"
      ],
      [
        -0.9956,
        "It is a very very good application for online classes🙂 I totally love the app It's really helpful Very good! 😊 What could I do without the app! VERY VERY GOOD APPLICATION 😍 I have a class EVERYDAY! Nicely done👍 And does not have any ads! Thanks for the app EXELENT! 😃😄😀😁🙂☺ Bye Bye"
      ],
      [
        -0.9863,
        "Great app, very well organised, easy and fun to use. Just one question: For satellites, would it be possible to add the magnitude value as a second curve to the object's visibility-over-time plot? The object visibility plots are really great and offer a lot of detail of the selected object, but I feel like they don't help you much if you want to determine if you can actually see the satellite. Mag info over time would we a great thing to have! Possible? Visibility plot is a feature of the plus version, but it seems that if you purchase in-app-monthly google does not let you write a review for the plus version in the store, so I am trying to reach you here. Since I am mainly interested in satellites, the mag feature would make the difference for me to keep the subscription/ buy the plus app. Thanks for reading my review and for developing such a great tool."
      ],
      [
        -0.9852,
        "My experience with oliveboard is very good. All teachers are very kind and helpful. They helps me to clear my exam. With the help of oliveboard i cleared SBI JA . So thank you so much oliveboard. And also i suggest to my friends to join oliveboard and become successful in life with the help of oliveboard.🙏🙏🙏"
      ],
      [
        -0.9889,
        "Ok I love it, but can you please unlock just 2 place it's kinda boring, if you did it, it would be fun like Toca Boca it's all free but this is an amazing game just unlock some places and if you did it it would be awesome I'll rate it five. And I hope you can add clothes to parents that's all. Recommend this,."
      ],
      [
        -0.9879,
        "It is very very nice to have a good practice all children can learn the lesson and they can practice for their all the test and i have to tell to all to dear parents, that please download this Questt - practicing app. All school have this Questt - practicing app for you children and all Teacher's can give Test, Revision worksheets. Thank you😊😊😊😊"
      ]
    ],
    "top_women_negative_reviews": [
      [
        -0.9726,
        "I am using the Android 10, but still the videos are not displayed and I am unable to complete my course. Some videos are playing while many are showing this error \"Media could not be loaded, either because the server or network failed or because the format is not supported. Kindly resolve my problem. The problem still persists."
      ],
      [
        -0.9345,
        "The app used to be great in the beginning but then I realised that 90% of the companies fail to acknowledge and update the candidates even after submission of assignments. I have lodged a complaint regarding the same and recieved a regular message from Internshala to attach a screenshot of my problem! Really? Screenshot? This is a very common problem and Internshala is resting on it."
      ],
      [
        -0.9387,
        "I am not able operate this app smoothly although I am using it for a long time. I have good internet connection but still I have problem in some features like doubts feature, I am not able to open it, sometimes I don't even see this feature and it sucks when I have any doubt and i can't solve it easily. And when I open profile page then it shows nothing, just a blank page. IT REALLY SUCKS. I hope your team will take any action regarding my complaint."
      ],
      [
        -0.9126,
        "Considering the negative and positive qualities, the net feedback is totally dissatisfied. Spent 6-7 in this app, but usually get a bug or error, whenever I send my query to topprs staff, they don't even respond and close the chat or send error text. Furthermore, if I close the app while the live/recorded lecture is ongoing, I still get playback audio although I'm in my home screen that's too annoying. It consumes my data and power both simultaneously. This is happening since 1-2 months. Fix it."
      ],
      [
        -0.9102,
        "I have purchased a pack for attempting mock test but I faced some issues here. First of all this application takes a lot of time to loading question while internet connection is good and other application is going very well. So you should work on this issue to solve this pathetic problem otherwise it'll be very irritating for the aspirants. And you should add another feature of showing rank of the candidate after attending mock test."
      ],
      [
        -0.9377,
        "It's a very study full app! The features are amazing! But the only reason I gave it 4 stars as the home page and many spots in the app can't be rotated landscapely [Mainly video and live classes can be rotated!]😬, other centers in the app can't rotate at all! It creates too much problem and disturbance when I study☹ It causes neck pain too... as I've to bend my neck for a long time! So I request an appeal to the Vedantu Team to look after this problem and solve it as soon as possible 😉😀"
      ],
      [
        -0.8481,
        "Every 2 mins byju app shows error. So not able to study anything. Every 2mins it asks to report. Pls fix dis issue. Never seen such a worst learning app. Every next minute it asks to login and it will not take login details. I thought of subscribe for test series, if dis problem continues how can i subscribe with this issues"
      ],
      [
        -0.8807,
        "The people scare me and its unfair to have to watch adds to get other stuff or you have to buy the full version of the game again the people scare me so much it is a weird game"
      ],
      [
        -0.8976,
        "This app is really very well for those students who are preparing for any competitive exams like - NDA,CDS,Railways, Banking etc. But problem is that the examples of vocabulary is so poor and tricks are also very poor. Overall Achhha Hai Please Try this app once"
      ],
      [
        -0.8869,
        "Worst app. I have never used such a terrible app. No words to say. So many problems are there. Who expects such an app to waste all our time. Very slow and not playing the content also. For what purpose is this app. After completing the course finally it does not update. Once it says that you have successfully completed the course in the morning but after some time its not showing that you are completed. It shows wrong."
      ]
    ],
    "top_men_negative_reviews": [
      [
        -0.98,
        "Not worth of even a single star. So many mistakes. Bad language bad material bad solutions and uncountable errors. If you're preparing to fail in all the examinations you're appearing, then do use this app. Don't have enough words to diss this app. So bad so so so so so so so bad that even selected MTS would have more knowledge, logic and sense than content developers of this app. Even 6th grade students of good schools have better sense of language. Waste of time, effort, money, & even data."
      ],
      [
        -0.974,
        "This is the best educational platform equipped with all the necessary things required. But it lacks in one main thing and it is the major negative point of the application. The user interface is very poor. In my previous review I had complained about it but still no improvement. Whenever I download notes the study tab stops working and I have to restart the app again. Another issue is that whenever I ask a doubt the app prompt me to give feedback to my last asked doubt even after I gave feedback"
      ],
      [
        -0.9695,
        "There's something wrong when I'm trying to take the picture, if I take a pic at the question, it works but when I tried to reuse the picture to scan another question (like move the square to take question) it doesn't scan, it either say that this can't scan because of bad internet or I can't tap \"scan question\" thing and doesn't work even I keep spamming. This is not normal since I used brainly alot in the past and didn't encounter this problem. Fix this, it's very annoying retaking the pic! >:"
      ],
      [
        -0.965,
        "Tests and quality of questions are superb. But the main problem lies with the app. In jee advanced tests it gives wrong answers while the solutions are correct which results in unnecessary negative marking even though the questions are attempted correct.in every paper there are 5-6 question whose answers are given wrong. Plus while giving test it shows there is some problem try again .answers would be not saved even though internet speed is high. Please look into this. it sucks"
      ],
      [
        -0.9173,
        "So bad UI (user interface) you have. You have a must need to work on the UI of the app. It's really so tough for a kid of 1st Standard to use the app conveniently. The Replay classes UI are so bad and the Teachers who teach, they also don't use proper lightning to get visible. The \"Back\" button gets you to the Starting of the app, not at the previous Page. There is no any Search Option. You really need to work on these facts. You must focus on the Basics of the app.The app badly need improvement"
      ],
      [
        -0.9633,
        "Don't download this app. It's a scam. Firstly they charge you and then your money just go to waste. I paid for tyari plus but it was not been activated. No response from the customer support.(They have no customer support actually). Worst app. Worst experience."
      ],
      [
        -0.9498,
        "I purchased this app. Vocab 24, but not good experience so I am not recommend it Because it is not content quailty. Pronounces not working after some time. I am facing problem. But no solution. There is not way to solution of this problem. If you are not even give any star, you are not able to sanding massage."
      ],
      [
        -0.9288,
        "Good content. But Worst support service. I paid still no access to the content. And no response from 2days. Really frustrating. No retention because no dissatisfied user will come as no help support. Phone support is just for show"
      ],
      [
        -0.9418,
        "It's very dissatisfying and disappointing as I answered the quiz of modules but it still showed ongoing. I had to uninstall the app and reinstall it. But still it continued. I managed to complete two modules but module 8 I couldn't complete because just I couldn't download the content to play of explore . I tried so many times it shows error. This is not fair as due to this inconvenience I will not be able to get a certificate of completion after trying so much. Very much disappointed"
      ],
      [
        -0.9167,
        "Lots of good information and data, but can be cumbersome to navigate. My biggest problems are that 1. There is no way to edit or delete a gallery that we make under our profile. 2. No way to suggest museums and art pieces that are missing from the app's database. For example, my city's art museum is not searchable in the app. Also, no support."
      ]
    ]
  },
  "entertainment": {
    "total_reviews": 1600,
    "total_female_positive_reviews": 501,
    "total_male_positive_reviews": 437,
    "total_female_reviews": 834,
    "total_male_reviews": 766,
    "top_women_positive_reviews": [
      [
        -0.9963,
        "I want to say that this is really a very good app and it's help me to improve my voice it's have all kind of songs if you don't know the lyrics so on the screen the lyrics will present and you can sing from them it's really very nice app I think you should use it if you want to make your voice better thank you!....... 💜💜💜💜💜💜💜💜💜💜"
      ],
      [
        -0.99,
        "Amazing! However, wish there were more poses. I wanted to create a fun comic with all the characters I have designed, but there is so little option to do so as there aren't many poses and expressions, and most of them are front faced. Good job on the backgrounds! And dresses too! I love the ones we can buy with coins, but I really wish there were more options to get the prettier ones. However, one of the best avatar-making apps as of yet. Kudos!"
      ],
      [
        -0.9911,
        "I love Bitmoji! It is so fun to send these to friends and family! I especially love the quirky and silly ones and the ability to change my outfit. I hope they will make more that are focused on being concerned or encouraging there person I'm sending it to--they seem to be really heavily focused on the self. However I always find something I can send and add my own text. Strongly recommended to make texting more fun and help the other person feel your personally more!"
      ],
      [
        -0.9897,
        "This is just the best app ever!! Love singing songs and uploading it and being rated. Also you meet new friends and get awesome rewards! 👌🏻 If you love singing then Starmaker is definitely the best app."
      ],
      [
        -0.9886,
        "This game is so fun and creative. Not only that but there are not a lot of add and you get to customize your character yourself. The fact that every costume is prized teaches us smarts and quick thinking. It's so cool how easy it is to get coins on the game. The costumes are super fashionable under up to date with the latest swag. All in all this game in a fair and amazing game"
      ],
      [
        -0.9899,
        "This app is the best, I have been using it since 8-9 months and well I really love using it, I love the gameplay, all the new features you have been adding are amaaaaazing and well I just have two suggestions in mind which I would love to see in the app and those are 1. we would be able to gift creator items 2. We could have more options of earning zems, for examples by completing quests but rather than once a month how about once a week? I hope the Zepeto team thinks about my suggestions💜😊💜"
      ],
      [
        -0.9907,
        "Dear Developers, Thanks a ton!! Owing to the pandemic, my bestie and I have landed in our respective hometowns and this app has added so much joy to our conversations. The wide range of options to customize the avatar to make it look just like the person, makes me miss her a little less!😁 We love the amazing attention to detail, the wide range of selections for every sentiment and the sheer cuteness of each icon. You have done a wonderful job! Thank you!❤"
      ],
      [
        -0.983,
        "I am not appreciative with this app. The event which are arrived in app is good the winning chance is less than 20%.This app data too much but not give an exclusive reward. Please increase the chance of winning an exclusive reward. If it increases then I will give you 5 star. Please focus !"
      ],
      [
        -0.9857,
        "Your app is a good one . But u can reduce the subscription fees as it will be easier for us students to afford it . Over all the shows are quite good and content driven , especially the series named Test Case. Its simply brilliant. I really hope that u make more series on soldiers and especially females, for it is relatively a new ground, and have huge potentiality and very inspirational also. Plus it does helps to break the conventions and stereotypes something which is very much needed now"
      ],
      [
        -0.9838,
        "This game is excellent! Why? Well... Because they are a lot of hair , outfits , accessories , inspiration Etc . So I really recommend this app because it has like a lot of characters that you can customize, I love doing that if you like doing that maybe download it than! There's not any adds only if you click on a add to get more coins an ad pops up. So I already recommended it to my friends and family and so I recommend downloading it if you have any of those interests!"
      ]
    ],
    "top_men_positive_reviews": [
      [
        -0.9895,
        "Seriously!? Who in their right mind would pay $25 a month or $100 a year for an app, especially a coloring app!? Yes, some very basic pages & colors are free. But all of the good stuff is in the paid-only version. I'm extremely content with Happy Color (which was a very worthwhile $4 to remove ads for life) & my Samsung Penup coloring. Both are free and at least as good or better than Colorfy. This app is suitable as a free app only. If u pay for the \"extras\", you're naive and/or rich."
      ],
      [
        -0.9893,
        "Thanks so so much for bringing back bath tub raccoon!! 🥰 best bitmoji ever!! Thanks for fixing the bug with Telegram! 👍 Bitmoji is cute and fun way to interact with friends n such. So many available scenarios to send out. They keep up with holidays and trends. Customizations for look and fashion are having more and more options. Love the new and fresh choices!"
      ],
      [
        -0.9875,
        "So far this program is fully-featured awesome. I like the functionality. Love the variety of images and creative abilities. The bitmojis do add fun and interesting flare to text messaging. I am pleased that I came across an ad on AARP presenting the app info while viewing browsing articles! I don't recall seeing any ADS included in the bitmoji app, great! 👍🏼😊"
      ],
      [
        -0.9856,
        "This app is awesome. As someone who watches a lot of TV shows at once, it can get overwhelming and I end up forgetting to watch shows for months, TV Time pretty much saved the day in that regard, I also love that I can see and share comments on each episode I watch, as well as view awesome statistics about my TV watching 📺 😀 Thank you so much for this app 💗"
      ],
      [
        -0.9869,
        "This app is decent and is pretty good to be honest. The easy navigation around the app is supherb, the options with the ease of accesibilties are very good and the features are stunning to say the least. The only thing I would change is how you have to sync youŕe Google account and save your details and enable Permissions like auto-fill passwords, payment options... Overall, the app Google has created is itś own Play, Achive and one of best mobile playing experiences. ( 4 Stars )"
      ],
      [
        -0.984,
        "💕 I love this app!💕 I usually try similar apps and delete them after a month but this one's a keeper! Its easy to use and search to quickly message and keep up with your chats. There's sooo many Bitmojis. If there isn't one you're looking for you can customize one! The avatars are detailed & fun to make into unique little bitty me's or wannabes! 👉🥸 🤳 There's tons of outfits too. I wish more friends & frenefams would use this. On the flip side, I'm the classiest with my Bitmoji avatar!😂👍"
      ],
      [
        -0.9861,
        "Outstanding! I love it! You choose your own songs, effects, and are able to record in your own style. Best of all, you can practice till you get the right sound before you upload it. There's also plenty of good natured support from other members and lots of fun to be had in live party rooms and events to turn your pastime singing into full time blast.! I totally recommend this app for beginners and seasoned pros as well. Have a good time doin' it!."
      ],
      [
        -0.9842,
        "This app has improved a lot. Hoping that this won't take too much of my storage. But opening the app got a bit faster than before. I hope it will continue to improve so that the app would open in less than a second. AND THEY FINALLY MADE ME SUBSCRIBE TO IT. 💖 May the k-idols be more interactive in this app. PLEASE MAKE THIS APP FASTER. THANK YOUUU!!!"
      ],
      [
        -0.9831,
        "Brilliant fun, great laughs. Could do with a few more or clearer tooltips when it comes to features like voice changing and stuff, feel like I stumbled across it rather than learned about it, may have accidentally skipped past it if there are tips like that there. Overall though brilliant app and good for a laugh."
      ],
      [
        -0.9857,
        "I love this App! It is such a wonderful App! It inspired me and sparkled the flame in me to sing. It deserves a Novel Prize! It is the next best thing invented in the virtual world along with YouTube! Thank you to all the people who collaborated in creating this Masterpiece!"
      ]
    ],
    "top_women_negative_reviews": [
      [
        -0.9794,
        "This aap content is good , but the aap is very bad , I can say it's worst aap, service is not good running very slow always show you poor internet connection even if you have high speed internet connection, hot star Netflix Amazon prime videos running smoothly even live shows and match also ,but in this aap if you try to watch something it's very difficult, very disappointed"
      ],
      [
        -0.9718,
        "Worst live streaming ever. My wifi speed is 80MBPS above only... but still the live gets stuck for every 30 seconds. Whats wrong with this? Replying for your comment: No point of writing mail to you when you can't even understand what we are facing issue with. The issue is with your app. It stops streaming for every 10 seconds, buffers for another 10 seconds and then stops after 10seconds...repeats. What kind of app is this? Worst ever."
      ],
      [
        -0.9669,
        "You fraud cheaters where is my money give my money back. Guys don't download this app this app is a worst app. No video running properly sound quality also very poor. App crash again and again. And if you try to complaint app also crash again and again. They give us subscription only for view a app looking not playing. Fraud guys. And graviance leader Ms. Isha is also not reply. She is playing with us hide and seek."
      ],
      [
        -0.9566,
        "Total Scam!!! I paid for 3 months subscription but its not showing anything about the payment made. Money is deducted from my account. I have sent screenshots to their mail id sever times and got no response. I have updated and restarted the app and it has no record of my payment. Worst customer service. No reply from their side. I need my money back!!!"
      ],
      [
        -0.9446,
        "I have booked in thrice times, amount has been deduct but ticket has been not booked. I have complaint to app, but no response, this is a completely fake app. Please don't get download this app and never will you watching the movie of PVR. PVR is fake theaters and fake app launch."
      ],
      [
        -0.9519,
        "Parental controls are lacking. It keeps populating too many Halloween videos. It's almost valentine's day shes stuck in Halloween! Now, off screen she is scared/paranoid and all about fear games. Possibly her algorithm bc she selected so many Halloween videos, but I see in reviews it's a problem for many. I tried searching/selecting Xmas n valentines vids to mix it up but it didn't help. It's too tedious to individually block all Halloween vids/chnls. Need a way to block by theme/tag/keyword."
      ],
      [
        -0.9617,
        "Very pathetic state I would say, sometimes problem in the sound, sometimes AC n worst of all is I faced problems in my tickets, booked tickets on the app but I was issued wrong tickets There was no movie at that particular screen where I had tickets for. After all this no one is even bothered to get back n apologize for their mistakes Looks like everyone is busy promoting the so called hyped movie, n not even concerned for any other problems taking place or to sort it out...worst experience eve"
      ],
      [
        -0.9444,
        "The most disappointing unfriendly update I have ever received of any app. I am really frustrated at it. I can see a lot of things on app like plays sports etc etc but where the hell is movies section. I can't find it anywhere and only place i can find a movie is search bar. It is really very frustrating. Hope you get it right in time 😠😡"
      ],
      [
        -0.9432,
        "I'm giving 1 star to describe my complaint. For 4-5 month it was the greatest app But after 4-5 month when I takes this app It shows [A temporary error has occurred. Please try again. (Error code : 0) It is very irritating 😒 And I tried to take it in google it's working, but without clarity and can't give like and comment. this app is soo.... annoying"
      ],
      [
        -0.9257,
        "This is the worst app ever. I really want to watch some shows or serials but it won't even load. Like I tried everything from clearing it's storage and cache and reinstalling the app. But it still wouldn't work. It keeps showing the ' something went wrong ' sign again and again. If there was an option of half a star I would definitely chose that 🙄 Really disappointed 😕"
      ]
    ],
    "top_men_negative_reviews": [
      [
        -0.9726,
        "The app's parental controls are mostly fine except for the search feature not being a necessary feature and being optional. Only Full Screen which can be uncomfortable. The content for toddlers are somewhat mixed and mindless. The recommendation of content to the Pre-teens are scuffed and lacks context, perhaps suited for 6-9 year olds, but not as much as the toddler section. It hurts children's brains. It hurts me most. No video settingd, countless ads, just a stupid, mindless cash grab. BS."
      ],
      [
        -0.968,
        "There is no issue of add but after add everything is stopped. Need to do exit and should start again. When we start again then again add shows and again after add it will stops. I am already using hotstar there is not at all issues. So you need to update apps and bugs. As your app is worst i have ever used !! Moreover subscription is not the solution of the problem I'm highlighting you actually problem what you don't want to understand!! After advertisement streaming content should resume!!"
      ],
      [
        -0.9609,
        "Till a few weeks back it was amazing but now it's become just time wasting. People complaining but no one is doing anything. The timing of the beats and the singing is getting disturbed everytime you complete a song. At first when you hear before posting one needs to manually adjust the speed which is so wrong. Plus then after you are able to balance it manually in latency, it again gets disturbed after posting after which you cannot do anything but delete the posting and re record and same agai"
      ],
      [
        -0.9537,
        "Horrible app. I downloaded it on my tab and initially it worked well but later on there was no option of full screen rather the videos are now played in 1/4th of the screen at rightmost corner. Don't buy the subscription it is complete waste of money. Even after sending mail thrice about the problem, no positive response from their side. Not just the app, but the customer service is also horrible."
      ],
      [
        -0.9638,
        "The game is good but it always lags and there are a lot of bugs when you use the creator's templates it always lags and loses sounds. And when you open the app the next day, it's always \"temporarily error\" really annoying. It's boring to play because there are only a few worlds and it's hard to get coins and zems. And you can't buy clothes because of the high price. I've updated this app a few times but still nothing good has happened."
      ],
      [
        -0.9554,
        "Hello developers, there's one thing, that's absolutely annoying for media apps, and that is if you provide a download feature for offline viewing, why wouldn't it work when offline!!! This is so damn irritating. I have speed issues, so I downloaded the videos overnight so that I could watch them next day and then, when I try to watch, I get an error message \"Your Internet is acting up\"!!! Seriously!!! Edit: Also, what's with this forced aspect ratio, could you please work on these issues."
      ],
      [
        -0.9607,
        "Very bad experience. They are blocking upper section tickets and releasing lower section tickets first. Whoever booking earlier are fooled by booking lower section tickets with the same price of upper section tickets. This is what happened for me to radheshyam movie in inox, madhinaguda , Hyderabad. Worst app you can not book your free black tire tickets for hyped movies like RRR it Will always show some error occurred"
      ],
      [
        -0.9503,
        "The worst of them all. Not worthy of a single star. I had uninstalled it nine months ago because of the intermittent breaking of audio/video and very poor picture quality. Today I reinstalled it again thinking that it might have improved after a long time but alas! Audio and video have gone totally! Woe to the developers. Learn from YuppTV, SonyLiv and JioTV apps or drown in a bucket of water."
      ],
      [
        -0.9515,
        "It's fine. But it gets quite boring after a while. Nothing interesting to watch and they removed a lot of shows and cartoons. Slightly disappointed. Also when I watch something, it glitches and lags my phone. I had it checked out and it's not my phone that's the problem. It's only when I play something on netflix that it happens. Really annoying makes watching things impossible. It started happening after the last update. Also the image will freeze but sound will continue. And theres a new bug"
      ],
      [
        -0.9559,
        "This is a good app and i love that I can draw my own mandalas but Im having a problem when we can't save what i draw until there is a color put on it somewhere. Here's where the problem with this starts.. I guess you don't consider paying a premium price means we have to put up with annoying ads now so I won't be renewing my subscription next time. Last year I didn't have ads with the subscription so why why ????NOT HAPPY!"
      ]
    ]
  },
  "healthAndFitness": {
    "total_reviews": 1974,
    "total_female_positive_reviews": 862,
    "total_male_positive_reviews": 678,
    "total_female_reviews": 1093,
    "total_male_reviews": 881,
    "top_women_positive_reviews": [
      [
        -0.9943,
        "I had never experienced the Himalayan Meditation but as I began to use it, I fell in love with it! The Graphics, the music and mantras are all great! Soothing and it makes me feel like if I was in another place in another time. The messages it has as well, are very relaxing practicing mindfulness and having a calm meditative mind through out the day. Good for when you're feeling stressed out or blocked. I recommend this app and hope you can add more features to it!! Thank you 💚🙏👳‍♂️"
      ],
      [
        -0.9939,
        "I have never written an app review mu entire life but I cannot do so for this app!! Keep is the best workout app out there; I have tried many workout apps since I'm obsessed with fitness. some were good but none were good as this one. Even without having access to the premium version, there are still many great plans are offerred. The fact that it gives you plans based on your goals that you can keep track of is just perfect. The motivational music are awesome, the guide for moves are perfect and even without having access to the premium version, you can still find many great plans including strength workouts, HIIT, stretch and whatever workout type you can think of. Thank you very much developers!!!"
      ],
      [
        -0.9919,
        "I've only had it for a day, but so far so good! I have the free version and while the app makes clear the benefits of having the pay version, the free version is still fully functional and ideal for anyone new to fasting. The app itself is pretty intuitive, and I say that as someone who doesn't use a lot of fitness apps and trackers. Plus the ads aren't obtrusive, which is a pleasant surprise!"
      ],
      [
        -0.993,
        "Great app starting with simple easy routines which progressively become more challenging but its so well timed you don't feel any extra strain. The graphics demostrating how you should do the exercises are so clear and the voice instructions so perfect that l fell in love with this app the first time l used it. To the developer , great work, thank you for this app."
      ],
      [
        -0.993,
        "This yoga workout app is the best and works like no other. There are many great features and overall this yoga app is the best. When I am typically trying to find a workout app that fits me and my schedule and what helps me it is hard there are a lot of apps that say you need to go on a diet and blah blah blah. Not this one there are simple minutes workouts that work like a charm!!! I have been doing three workout once a day every day and I already notice a difference! There are different levels of workouts as well so if your new you can take it easy and gradually get better and more advanced. This apps features are the best! There are a bunch of different workouts and they work. This app lets you track your progress and your weight change this app has helped me feel better and become more physically and visually healthy!!! 5 stars and would totally recommend this to anyone who is busy and is looking for an app to help them get started and see a difference!"
      ],
      [
        -0.989,
        "Thank you so much. I really recommend this app,it helped me track my eating and fasting time. Now, Ive lost 10kilos and that's with minimal exercises only. All thanks to this app & still using it until now. Super worth it!!! Now I am really much confident about my body. Also love the challenges every week. Kudos! Thank you again ❤☺☺"
      ],
      [
        -0.9877,
        "This app is BY FAR THE BEST workout/fitness application you can find out in the market. Some of it's many awesome features being: Perfect UI layout for easy navigation, Appropriately grouped workout routines, Wide variety of exercise library which you can use to create your own custom workout routines, & the best of all is the in-app videos demonstrating the accurate way to perform those exercises. Don't waste your time searching any other application cause this one right here is simply THE BEST. However, there are some simple UI bugs like Newly added workouts/exercises do not get instantly populated in areas where they should. Also, it would be nice if we can view \"My custom workouts\" & \"demonstrations\" in offline-mode."
      ],
      [
        -0.9908,
        "It's absolutely motivating to look at all the success stories and read their struggles. Love this. Diet tool is easy to use but gets clumsy at times. It will be nice if there is a exercise tracking tool as well. Like, we select the exercise and add the sets or the reps performed. I understand, we are still evolving. Just a suggestion though, to be better as always. Thank you for bringing health and wellbeing to common people in most adorable cost! Luck & Love..."
      ],
      [
        -0.9894,
        "This yoga app should really get more attention and credit. I love this app because you can do all the workouts free, and you can make your own! It also helps me a lot with working out because it reminds me when to workout and it makes me stronger and very good. The lady in the workouts is very nice too because she always tells me when I’m half way there and what the next exercise is. I used to never workout and always eat and yeah. But thanks to this app (and to quarantine) I was able to get back in shape! It is also very helpful because it allows me to adjust my rest time in between exercises. It just gets me in the shape. If you are not using this app and have to use other apps that aren’t not free, idk WHAT you are doing! Very good app. Yeah, 10/10 would recommend it. Definitely. Very good."
      ],
      [
        -0.9853,
        "Really helpful. Lovely exercises that aren't to difficult, especially for beginners. Love the notifications to push me a bit when I need it. And the water tracking helps me a lot too, since I didn't drink enough water before. The reminder is great and I love the little texts you get on why drinking water is good for you. Very motivating!"
      ]
    ],
    "top_men_positive_reviews": [
      [
        -0.9959,
        "I love how the yoga app plays upbeat music to get you in a good mood. The music helps me a lot so I feel confident in myself and not talk down about myself. Like I said today is the first day of me using this app and I am so excited to learn so many new things that the app has in store for me on my journey. I would totally recommend this yoga app to so many people and I’m so happy my friend recommended it to me. I WILL be using this everyday so I can stay motivated and happy. Especially with all the options of workouts I can choose from. I hope everyone can find this awesome app and feel just like I do at this very moment. Which is happy, motivated, and confident,It helps me to improve the corepower either."
      ],
      [
        -0.9947,
        "I really enjoy working out with this app. It only lasts 7 minutes but very impactful. I love the fact that you can choose how intense you want it, from easy, medium ect. I also like the 30 days challenge option, Its a great way of motivating yourself to work out and it's a great way to keep track of your work out sessions. I particularly love the fact that it contains minimal ladverts. Over all this app is great for all, beginners and more advanced users."
      ],
      [
        -0.9949,
        "I downloaded this app a while ago, & I just realized it a couple days ago, but I'm really happy I did. I absolutely LOVE this app! It has amazing inspirational quotes, It's super inexpensive, & it's literally helping me stay on track. I definitely recommend this app to anyone who is looking for self help. 😊"
      ],
      [
        -0.9878,
        "A beautiful and amazing app. Really love it so much. It truly helps a lot for relaxing and for a better sleep. The only thing which I need to concern is about it's battery consumption, which is high. For example if I put a timer of 30 mins then it consumes almost 15 % of battery. Please resolve this issue developer and thank you so much for such a great app."
      ],
      [
        -0.9919,
        "Hi guys, I love your app. Have used it for years! Here's a few suggestions: 1. Add a back workout - lots of people have spine issues and would love a suitable workout. You have really good back workouts spread across the other workouts - just bundle them (maybe add 1-2), done. 2. The \"Well done, congratulations!\" voice gets muffled in the end (I guess so the following ad can have full attention?) Please play the Well done sound loudly as it is such a rewarding experience. Then I am much more happy / attentive to watch/listen to the following ad. 3. Studies show that Waist-to-height ratio is more accurate than BMI when looking at obesity problems. Maybe you want to consider swapping or addting waist to hip. 4. It would be nice if (during the last seconds of the) current workout, the one coming up would be previewed so you can get mentally ready for the next one. Also when paused, the current workout should be visible. Keep it up - Thanks a lot for this great app! Til"
      ],
      [
        -0.9882,
        "I am new to yoga, i started using this app and instantly loved how detailed the sessions were but trying to do a work out off a little screen .I absolutely love this app and I am not even paying pro. I love that the program includes breaks and rest days and the instructions is amazing. I also really like that the types of workouts are varied and aren't just the same boring cardio sets every time. It's easy to stay motivated with such a nice app."
      ],
      [
        -0.9928,
        "Excellent and very flexible app with a clean & well designed user interface which can also log your practice and provide statistics and has an accompanying wiki website with importable breathing patterns. Only improvements I would suggest would be the option to enable Google Fit or similar data sharing (categorising breathing as meditation would be good enough if there is no breathing category) as well an option to choose an expanding & contracting ball or sun animation during practice. In particular the app's dynamic mode was very useful for my Resonance Frequency Breathing practice as while this breathing pattern is quite simple in normal practice (with a fixed breathing rate, and according to some recent research as well as my own personal testing with equal length inhales & exhales as this actually maximises your Heart Rate Variability or HRV, not longer exhales contrary to a lot of suggestions) you do need to find your ideal breath rate (resonance frequency where your HRV is maximised) and possibly also re-assess it regularly according to some research (personally mine hasn't varied much between assessments). Personally I found that the best way to assess my resonance frequency was to shift through a range of frequencies without pausing or interrupting the practice and so I needed an app which could automatically vary the breath rate every 2 minutes. Using this app's Dynamic mode you can create such a multiple rate pre-set program quite easily."
      ],
      [
        -0.9867,
        "[Update] Aw please just take back the last version creating food tool but improve the unit. The new one is good at unit but very inconvenient and difficult to use. When I saw full list of micronutrients with true unit in 'creating new food', I think this is the best version that satisfies me. But when I go to the report, the unit of vitamins are still wrong though the list is full. So I hope you will update true unit in report so the app will be perfect. Thanks"
      ],
      [
        -0.9873,
        "Excellent! Gets the essentials right. The sessions are perfectly conducted for beginners to follow. I think the (English) audio deserves particular praise: the instructions are clear, the voice is pleasant, and the audio mixing is outstanding. This is critical if you want to be able to do the exercises and not just watch the screen all the time. I also appreciate the fair pricing model. There is an intermediate tier (silver), perfect for casual users like myself. Highly recommended!"
      ],
      [
        -0.9857,
        "This is a very good app but it would have been better if you had added more languages, Hindi Marathi Tamil. Because my friends want to give this app to their mom to do her. But because of the language, unable to tell, it is a very helpful app, but the language is the same. a little work on the language. 😊😊"
      ]
    ],
    "top_women_negative_reviews": [
      [
        -0.9734,
        "Run as fast as you can from this company! They are dishonest and have TERRIBLE customer service. They gave me a renewal date and said if I canceled before that date I would not be charged. I canceled an entire day earlier and they still charged me despite me even screenshotting the renewal date. Customer service refused to refund and basically told me they would not help even though it was their mistake. I filed a dispute with PayPal and they are still trying to fight to keep the charge!!! Liars"
      ],
      [
        -0.9369,
        "Horrible experience using this app. They claim to sync steps from Google Fit, but if there's an issue, there's no accountability from their end. I used this app for one of my corporate events that turned out to be completely rigged in the end. There was no transparency in terms of how they evaluated the ranks. Highly disappointed with the overall experience. Uninstalling right now."
      ],
      [
        -0.9356,
        "Horrible how the say it 1.99 and then charge you 49.99 i want a refund horrible app if I can give 0 I would I never leave reviews but had to on this terrible app its a scam"
      ],
      [
        -0.9167,
        "At first it looks very appealing, but when I started to upload files for the claim I had the worst time! Even now I can't Submit the files as it keeps showing me an error that it can't find file. I'm really frustrated and want to submit the documents as soon as possible. There should be a live chat option for helping us with such issues in the app."
      ],
      [
        -0.9273,
        "Ever since the new update, the user experience has been awful. Why can't I have proper music controls?!? That used to be there before the update, but now I just have to turn the volume up to an obnoxious level to just be able to hear my music while working out. There used to be option to control the amount of instructions, but now it just keeps giving me annoying motivational statement and I can't even turn it off. Very pathetic user experience overall. >>:(("
      ],
      [
        -0.9186,
        "I have taken subscription for year... After that with in 2 days app stopped working.. I tried force stop and also uninstalled app and again install still not working... Show it error something went wrong.. So at this movement I can say app experience is worst for me.."
      ],
      [
        -0.8886,
        "Absolutely perfect when it works. But I have had to install and reinstall about 15 times so far because I get error code when the app starts up. If you want to use it as panic relief with the button it is very detrimental to be in the middle of a panic attack and have your rootd app not working and need a reinstall."
      ],
      [
        -0.8843,
        "Nicest worst app, though it gives us lot of yoga asanas and several sessions, that bloody player messing up all the yoga teachers efforts and it doesn't meet the requirement. To be precise, media player buttons doesn't disappear after starting the session and it covers several asanas during my workout which resulting in poor asana practicing. Worst ever app development I could have ever seen."
      ],
      [
        -0.8854,
        "Very bad app. The beta update has made it useless. Wish i could roll back to the previous version. Every page takes ages to open. Details and records of any card/activity does not open. Even an alarm is not setting properly. Calorie count is faulty. Any changes i make in the settings is not visible. No records or details of my daily activity. Very very disappointed."
      ],
      [
        -0.8849,
        "I can't able to login and use it for my child's hospital visit, in the hospital they are asking QR code for the payment , but i cant find that at all , so difficult and frustrated to use this"
      ]
    ],
    "top_men_negative_reviews": [
      [
        -0.9762,
        "My runs won't sync and that's frustrating. That is really not helping. Otherwise app is very good. Please fix this. New edit : are you even trying ??? This is such a brilliant tool bogged down by bad application. The guided runs are pure gold. But the app is bad. Really bad. So much waisted potential. Frustrating. Annoying. And STOP LOOSING MY RUNS !!!!!!"
      ],
      [
        -0.9657,
        "Fraud Fraud Fraud Useless app, ridiculous pricing. The gyms listed here charge way less than what the app shows. It's a scam. Beware."
      ],
      [
        -0.9501,
        "Would've been worth a subscription if it was inclusive. I'm disabled and some joints aren't always cooperative so I tried their \"gentle\" style but it had a lot of standing poses that are difficult on the knees and balance (vertigo), and while \"restorative\" has no standing poses, but it was hell on the wrists. If you have options to focus on a body part, you should have options to exclude them too. It could've been great if it was more inclusive for disabilities and chronic pain sufferers."
      ],
      [
        -0.9604,
        "I had a worst experience with the website and mobile application also. Very poor and pathetic website working gives you error at the time of submission. First the proces and eclaim form filling is very much lengthy and once you clear all hurdles it gives you final submission error which is worst than anything.Insurance companies are opened for collection of premium only. Even after your hospital discharge they will remind you hospitalization feel again. When the crucial process will update?"
      ],
      [
        -0.9537,
        "Stops working even after you go to the trouble of setting the settings the way they recommend. I've had this app for 8 months now and it continues to let me down at the very worst times what I want to know is why is all of the world of all technology going backwards. 2/19/22: made the mistake of trying this app again with a new phone seem to work fine for a couple of weeks but same old problems it turns itself off even when you give permissions for the battery to be drained. Why is tech so bad?"
      ],
      [
        -0.9432,
        "The latest update has really downgraded a simple and effective app. Others have spoken about how the graphics are distracting, but the single most degrading experience is the new voice. It's not only super difficult to understand but also speaks slower than normal pace. This has killed the voice guide for me, I now keep the phone on silent and have to watch the screen, which makes it harder to use the app. The voice needs to go ASAP."
      ],
      [
        -0.8774,
        "Never ever buy anything from China, its so bad, when the decide keep disconnected n cannot find my band, its cheap and useless China product , nothing can be link w the phone n smart watch, its all loading only, this China product is so bad n so untrustworthy"
      ],
      [
        -0.9151,
        "this seems like a wonderful app at first. collating data in one place. free. tracks steps and distance moved etc. but then you start to notice all the terrible things. there is no web interface. trying to use the awful graph of (for example) weight is frustrating and an almost entirely useless endeavour, as the shifting y-axis ruins any attempt to scroll across screens (and only in jumps of 1 year, 3 months, month, week). trying to view historical data on a tiny phone screen is a joke when one has a lovely large screen on a PC. i dare anyone to be able to get a decent history of their activity, weight, heart points or whatever in the app. it's impossible. how is one meant to see what health aspects were in a good or bad place at various times in the past? how is one meant to see heart points vs weight, or steps vs blood pressure? exporting the data is a nightmare. i thought that i would just exprt the data into a spreadsheet and make my own graphs, not so. there is no native ability to export data. one has to dig deep into the google ecosystem to get to all personal data, export only the fitness data, analyse and parse the export files for the info in the app that you need, extract that via json to csv... you get the point. what is the point of data if you can't analyse it properly? you can't even delete weight entries! you can only edit them. so if you mistakenly add a weight to the wrong date, there is no way to remove it - you can only set it to an estimate, which messes with the data. or set it to (for example) 0 and then filter that out if you've gone through the herculean process of exporting the data to somewhere more useful. there is no way to reorder the tiles in the app! seriously? if i want to see my daily steps wuickly, i have to scroll. there is no way i can move that tile to the top. this also means that adding a (for example) weight reading requires scrolling to the weight tile and pressing add, or by pressing the add button on the home screen to open up a menu where i need to select weight. and heart points as the second tile? who uses this useless metric anyway?"
      ],
      [
        -0.9456,
        "I hate this app. It's so unreliable. It only logs 4 out 5 runs at an average. That's really pissing off. You guys need to figure out why the app keeps crashing when I stop the run. Every once in a while, when I stop the run, it endlessly keeps loading and then boom, it's crashed. Worst part? I need to login again. And OBVIOUSLY the run hasn't been recorded. Ruining my Sunday. Ugh."
      ],
      [
        -0.9177,
        "It mentions all the rewards which it will give if you complete specific days at gym. However even after completing that specific number of days, I am unable to claim rewards. Very bad app. Not recommended. it is totally fake. Update: Now a days scanning at gym for attendance isn't working. Inspite completing 45 minutes of excercise as mentioned in the policy, it is yet not working. Really very terrible app. Do not waste precious time downloading it. Even all the offers are useless. USELESS APP."
      ]
    ]
  },
  "topGames": {
    "total_reviews": 1960,
    "total_female_positive_reviews": 656,
    "total_male_positive_reviews": 828,
    "total_female_reviews": 844,
    "total_male_reviews": 1116,
    "top_women_positive_reviews": [
      [
        -0.9958,
        "I have played many games on Android but have never left a review. This game compelled me to share my experience with you. An outstanding game with flawless controls. It is a journey in life where you meet unexpected twists and do your best to manage it. Scenery is amazing. The soundtrack is meditative and beautiful. I sometimes play the soundtrack from youtube while sleeping. It is not just a game for me. I play it to be motivated and energized. Hats off & special thanks to the creators."
      ],
      [
        -0.9953,
        "i love the game since it first came out in 2013, i was 8 at the time and the game is pretty good, but some things are somewhat unnesserary like how u need wifi to play campaign and to save data unlike back then, i wish they could bring back some old maps, old guns, and the great feel and charm it had, and the lvl matchmaking kinda sucks. not saying its bad, but it need some good old love, like it used to. love this game to death. i wish to help make the game better"
      ],
      [
        -0.9947,
        "Wow I really like this game. This is how games should be made. It is easy to play but still challenging and it is relaxing and fun. I love the power ups and all the fish I can collect. I don't even mind the ads. The ad rewards are way better then other games. They are perfectly placed and short. I can see myself playing this game for a long time. I'm very happy I found it. Great Job."
      ],
      [
        -0.9947,
        "I like this game and I also loved it's simplicity. Games are often expected to be impressive through graphics but this game has given me a different look! It's very easy to play till you are tactical and strategic. Give your best and you will earn best of the best rewards with only a small piece of work! Gold is also very easy to earn and guns are also awesome. Thank you developer."
      ],
      [
        -0.9918,
        "Give it a bigger soundtrack, and it'll get 5 stars. I'll lead with cons, then pros. Cons: Limited OSTs. I think it's only four songs, I think, that play while you play. They are very catchy and motivating. Heck, I'd listen to them while lifting, if I didn't have to listen to them everytime I play the game. They're awesome, but please have more so we get excited playing long term. Small fuel storage. Might be just me, but I feel real limited by the amount I can play, if I have one gap per day I can play. Upping the fuel limit even to 7 would be great. 10 would be amazing though(for me). Pros: The music is catchy and motivating. The gameplay is simple and addicting. Resources aren't too rare to keep upgrading. The ads mostly serve a purpose instead of overloading us. It's a pretty well balanced game."
      ],
      [
        -0.9912,
        "This game is amazing ! The graphics ! The collectibles ! Everything is amazing . Guaranteed one of the best games you'll ever play . Although I would recommend 👌 itachi reanimated ! Because I've been awakening him quite a lot recently and he has great attachs . 😃 😊 😀 Hope This Helped !"
      ],
      [
        -0.9924,
        "This game is fantastic. It's levels are fabulous. I just love it so much but sometimes when we enter the game notification comes on phone screen about navigation buttons are on and so we have to fix it .we are very sad and upset for that please fix these issues .we have no other issues. There,s a suggestion that the levels in the game shoud be increased because the levels has been old I hope you,ll think on this and thank you for creating such a fantastic run💗💗💗💗"
      ],
      [
        -0.9927,
        "Really very nice and so relaxing game . Both Alto's Odyssey and Alto's Adventure games are amazing games . The controls are good and very simple . Every one can play and relax with it . And the Zen mode is just amazing . Best game for relaxing with Beautiful scenery . It works so smooth and beautiful with one control. And ads are less and takes seconds to Complete. Really best experience with this game ."
      ],
      [
        -0.9904,
        "This is a good game! Been playing for two weeks now. Rewards are good, good action, no forced ads, only optional ads which actually reward you well. First mobile game I've had no problems or complaints about. It's good! I've tried many many other games, this one is the best I've played. I can't find any downside with this game, which is surprising, because literally all the rest are lowsy. Really good game!"
      ],
      [
        -0.9893,
        "I have played this game multiple times and the only issue I've faced is the fact that it takes too much time to get to the next level. The game is almost perfect and the story line is amazing. But from what I've heard around, many gamers like if there's a flow. The Loadout base totally kills the momentum by making us wait for a long time and not to mention the level waiting time. This is what many successful devs have used (FROM SOFTWARE). Other than this one issue, I love your games. 🥰🥰"
      ]
    ],
    "top_men_positive_reviews": [
      [
        -0.9963,
        "LOVE the most beautiful thing about your own and I am so happy to hear you say something about your favorite things and help me out and help out when you're free for the next two months or if there will understand a little about it 😀 and help you with a good job 👏 😀 😊 😉 ☺ 😄 you have a few things you want me with a good time to go with a good one 👍 you are a few more in your area than you can afford for your favorite sport to watch the only thing on your list and a great business plan 😀"
      ],
      [
        -0.9934,
        "Addictive game. Weapons are a little expensive to upgrade but, the game is one of my favorites. 👍👍 The latest Special Events & weapons are really cool. All the recent updates have been great. I have to add that somehow all my progress got deleted. When I contacted the Devs they were outstanding. They did'nt turn their backs & leave me hanging after so many hours & quite a bit of money spent. They gave me what I needed to help get me back on track. Very impressive Customer Service. Arguably the best in the business. Love me some VNG!!! Thanks VNG!!"
      ],
      [
        -0.9953,
        "Welp. Since the game keeps asking for my opinion, here it is. The game is really fun, you can get lost for a while playing this. But the replayability of the game is low. Some people enjoy fighting through the exact same level 40-50 times to get strong enough to get to the next level, but if you can't buy skips or don't have the time or patience for hours of gameplay everyday then this isn't for you. You aren't going to compete in the multiplayer. Give that dream up. Graphics are really good. The controls are pretty good, but they can get unresponsive at times. My suggestions for the developer(s) is to create more non-story content (not pvp). I enjoy the survival mode more than anything else, but if you look at the leaderboards....11+ hours are the best times in that mode. Come on. That needs fixing because 99.9999% of the human population doesn't have more than an hour or two at most to spend doing one particular thing (lest we have to remind people that most people have other things to do besides playing games). I'm fairly low level and I can run survival for 40 minutes. I won't be doing anything but skipping that from now on, skip availability pending; and so diminishes my favorite part of the game. I like what the devs have made here, but there are some serious issues that need to be addressed here for the sake of longevity of your game. I'm not writing a thesis paper here, so excuse me for not doting on the graphics (which truly are very nice) or other parts of the game I like. End note, the game is a lot of fun but will become monotonous fairly quickly. Enjoy while it lasts."
      ],
      [
        -0.9919,
        "Where to begin? This game is entirely something else. Each day you discover something new to explore and the ability to experiment with the characters are overwhelming but invigorating at the same time. Truly this is one of a kind experience that I wish everyone could just get a taste of. I only wish the best for the creators and developers in improving the game and I'll support them however I can. Once again, what an outstanding game!"
      ],
      [
        -0.9896,
        "Want to play a Beautiful and relaxing game? Odyssey is my go to choice! Gameplay if beautiful. Controls are so simple. Visuals are stunning. What is more stunning is the background score! Loving it since Alto's adventure. I've completed all the goals. Upgraded all the powerups . After unlocking sumara (after 50 levels) the additional 10 levels were a pleasant surprise! Some sorta reward would have been nice after finishing 60 levels. Disappointed there a bit. Else, just loved the game every bit."
      ],
      [
        -0.9944,
        "OUTSTANDING !!! Loved this game from the bottom of the heart !!! Especially for its Zen Mode which contains such a pleasant tunes which are like lullaby as well as in this mode, there's no limit of respawn (which is totally good) !!! But there's a need to improve the game like maps, characters etc. Recommended to play this game once and you'll fall in love with it !!! 👊🥰👌"
      ],
      [
        -0.9945,
        "EDIT: I LOVE this game! In-game voice chat for rounds would be super cool(maybe an in-game proximity chat). If you're thinking about downloading the game, go for it! It's super fun, easy to play, and even the colour-based tasks(wires) are colourblind friendly! (I myself am ADHD/Autistic, so having the symbols on the wires is super helpful when I'm having trouble understanding the colours. Yes, this happens! To me, at least.) Super fun, easy to play, I love it; I HIGHLY recommended downloading."
      ],
      [
        -0.9889,
        "Fairly good, enjoyable game. I know it's pretty casual, and that's great, but I feel like it needs more. More challenges/obstacles. Something to keep it more interesting like fuel powerups or temporary invincibility powerup or aliens. Or maybe moving platforms. Just something that makes it more challenging. Overall, it's a good game; the characters are fantastic; love the unique environments, backdrops and soundscapes that come with every character."
      ],
      [
        -0.9899,
        "I really love this game. The characters, the event and everything else is so good. It's just that leveling up the characters is a little bit difficult and I hope it can less difficult and also some event makes the performance lag and slow and I hope you can fix that too but overall, it so good. Good job and keep up the good work. 😁👌👍❤ One more thing, in this current event, I can't play the Soul Quest. Is it because I don't have Street Fighter character for it or else? Please reply ASAP. 🙏"
      ],
      [
        -0.9883,
        "This game is so fun. Much easier than DBL. Both are fun but LRs are so easy to get once you get one. It's fun and it's beautiful. The art is so good and the ultimate moves are awsome. If you have a lot of space and get bored of DBL download Dokan and have some fun. There's a free LR waiting for you to use it."
      ]
    ],
    "top_women_negative_reviews": [
      [
        -0.9943,
        "Overall the game is good, but they force you to pay for it by ad at starting of a mission and when its done. I was able to finish most of the missions, after which it is not letting me go forward, no mission pops up after it, I try to attend the briefing and all it does is asks me to go away and not disturb the guy. I don't if its a trick by developer to force you to pay for the game or something else, but its annoying. Other issues: Game does not play in full screen, there are big black bars on both side which takes up half of the screen estate, and its not as involving due to this sole reason. In some missions you are forced to play with some outside help, meaning you will have 2 to 3 bot allies who will accompany you, and its a real pain in the ass. A mission which you will be able to finish off way faster and better, gets you killed due to those fools, you cant ask them to stop or halt and execute some silent kills. This feature should be added, where we can control the allies movement so it does not end up getting us killed. My advice to whoever struggling because of it will be just get them ambushed and take some cover, once they are killed don't revive them until the end of the mission."
      ],
      [
        -0.9879,
        "Don't update it. There's nothing new in update . They just put the annoying pop up ad in update.😠😠😠😠😠😠😠😠😠😠"
      ],
      [
        -0.9861,
        "Good game but in this update, the game was full of lags, hard to fight. And another thing , why can't you add like choosing the characters such as black canary and green arrow. I hate green arrow, he does a very little damage and it very hard to fight. Even his supermove does a little damage. In campaign it is Good, but storymod it is very worse. This game is full of lags."
      ],
      [
        -0.9812,
        "It is the worst game I have ever played when I jump it doesn't want to jump it's not fair there are way to much ads I hate this game is just wasted my wi-fi on a game that dose not even work I wish there was a zero star my brother says it is boring to do not download this game it is the worst😠😠😠😠😡😡😡😡"
      ],
      [
        -0.9747,
        "You are determining who will and lose on what days this is sad. You people made me lose 10 continuous games and this is cheating. Game gets stuck on Finding players 6/6 and I have to close the game and open again. It's frustrating sometimes. Your servers are really bad too. I'm having network issues always. Worst game ever."
      ],
      [
        -0.9705,
        "I really like this game. But, apart from the game freezing at times when I have my data connection on, the game has a bug that constantly tells me that there is still one of the zombies left even after I have visibly killed them all. I \"killed this invisible zombie\" when I fired a few blank shots. This happened to me a few times at the prison. Please fix this."
      ],
      [
        -0.9642,
        "I played this game before. and I loved it. but after new update, things got messed up a little. pet stopped collecting gold, I stopped receiving energy and sometimes it changing to negative number, timers not working properly. can you fix it? (Samsung galaxy tab model) edit: I just noticed that there is also something wrong with rare/unique/special mobfish probability. I reached 22nd rank and still didn't finished any of the collections yet. sorry if i spelled something wrong. bad English exp."
      ],
      [
        -0.9565,
        "Game disconnects mid-battle all the time, even with full reception or when on solid home wifi connection. I lose credit for the battle and any resources spent. Makes game almost unplayable. There is absolutely no reason the game should ever \"disconnect\" in the middle of a battle. The battle assets and AI are all stored in the app. If a battle starts, it should carry through to the end without issue. If there actually is a connection issue during a battle, the app should simply sync the results of the battle when it reconnects. Seriously disappointed."
      ],
      [
        -0.9648,
        "This game was once good but soon it started to show its real colors. After every match it will show you a ad and it has also started to crash, everytime it shows a error, when you start the game it shows that no internet connection even my net is on. I even connected to my wi-fi and then my friend's and everytime it showed the same error. I am frustrated with this game. Creators do something for ads and errors too....."
      ],
      [
        -0.9693,
        "With the new update to the game with the extraction comes with some unwanted changes, for example the fact that zombies have more health and does more damage not, including the difficulty levels but the basic level that throw zombies at you that have higher damage and health making them harder to kill, with more zombies, all adding up to making them extreamly hard to kill. I would like for the developers to make changes to their health, damage, and ability (zombies)."
      ]
    ],
    "top_men_negative_reviews": [
      [
        -0.9829,
        "Use to be fun! Until 2 days ago the game was great. 2 days ago the in game ads for extra cash, diamonds, and game boosters changed, but also locked up and no longer gives the rewards for watching them. Without the benefit of rewards, you not only waste time watching them cause you cannot back out of them not even home screen button works, but it makes progression in the game extremely slow. I deleted the game today because there is no way to get ahold of support to correct this situation. I am not going to be forced to waste my time with ads and no benefits as well as stuck at my level it takes all the fun out of the game. Parts of the game that should be removed or changed, in my opinion: 1) the stupid overpasses that block your view 2) the missiles launched at road block choke points, the impossible ones I seemed to always get that hit as I entered choke point. 3) the vehicles that constantly shoot rearward, they follow your every move. 4) the number of rear shooting vehicles in 1 screen 5) the fact that at about 1 minute mark, you can no longer destroy any vehicle other than hitting them and after hitting 5, you are dead. I am at max front and side guns and max armor. But am, according to the game, moving too fast for ammo to hit and destroy the targets. 6) constant road blocks. Remove about half of the road blocks and it would be more fun"
      ],
      [
        -0.9783,
        "This game was fun, but this most recent update ruined the game. It is even more difficult than before to level up your characters. They changed the item level requirement. Now you have to be level 14 to have all 4 item slots filled meaning that it will be even tougher to kill the higher levels in the already horrible matchmaking system. This game is dead."
      ],
      [
        -0.979,
        "It is good because of the collaboration of certain character from the other games, but the devs of this game really don't care about their players. They just want to earn money from this game but other than that, nothing! They can't fix a network issue, they can't even fix the matchmaking in battle mode, and the worst is... If you got matched on a player that has low ping, you will be the one to suffer the lag and guess what! The game will force you to quit because of the network error."
      ],
      [
        -0.978,
        "The trophy system isn't the best you can earn up to 6/7 trophies max in a battle however you can suddenly lose 60 if you lose a battle. I won a battle and the game lost connection right at the end to see I had lost over 60 trophies because of it. The game almost forces you to battle weak opponents, Or face grinding your way through repetitive battles after losing one."
      ],
      [
        -0.9618,
        "Weird bug ruined everything I was a big fan of Alto's Adventure. This game also didn't disappoint me but after I get past Level 25. I can't play the game anymore. I tried clearing cache. It didn't help. I reinstalled the game and it worked but when I tried to sign in with Google Play Games, it started crashing again and I can't play anymore. So all my progess (Level 25) is gone. This is very sad and frustrating. I don't wanna play from beginning again. :("
      ],
      [
        -0.969,
        "I have been thinking. Probably a bit late for this next update but I have two ideas. 1: add piercing power, which would bring in the flood mechanic. More piercing would mean more flood damage, but it would only be restricted to weapons that fire bullets. 2: integrate ship power with matchmaking, so you don't have something too op on yours or the enemy team, so it's more fair to newbies, and so you don't have a medic spamming repair bolts healing from almost nothing to full hp. More common parts."
      ],
      [
        -0.9743,
        "There are many things you could have done but no you didn't even bother to try. I hate the system of autofire. It makes the game like of you spot the enemy he is dead and vice versa. The controls are also bad. And why everytime I play I only got team death match. Is it only because you didn't devoloped more or that the is a bug FIX IT"
      ],
      [
        -0.9772,
        "The game is fun and all but there are issues that make no sense and need to addressed. In battle Royale it makes no sense how a shovel can kill you in five hits but I have to use all my bullets just to kill one person. In all the classic modes, the matchmaking is horrible and almost every weapon is unbalanced to the point you can't even play the game. The game is pay to win so unless you spend money to get the overpowered weapons , there's a low chance you can actually win."
      ],
      [
        -0.9777,
        "Fun game, but the black market weapons are a total scam! They will only offer weapons a tier or 2 higher than the weapon you already own, even though they are already obsolete. It forces you to waste gold on the regular version a tier before the one you want and then spend more gold on that weapon. They also won't let you buy the version you want. You have to hope they offer it randomly. I waited for a year, gave up and bought an inferior version, wasting 13k gold, about $100 worth in real $!!"
      ],
      [
        -0.9517,
        "I like the game overall but there's one issue. There's a chasm which you have to cross using a wall climb but the crossing is a very high climb in a very small distance which is impossible to cross using the wall climb. The player always dies and as soon as we crash, the hill disappears and the player seems dead suspended in the air."
      ]
    ]
  }
}
